Rubikrubi/zegar-WAVESHARE-ESP32-S3-4-2-cala-RLCD/zegar-WAVESHARE-ESP32-S3-4-2-cala-RLCD v6.0.ino
// ============================================================================
//  Zegar NTP RLCD v6.0 — 28.06.2026 — czysta architektura (rewrite od zera)
//  Sprzet: Waveshare ESP32-S3-RLCD-4.2 (ST7305 refleksyjny 400x300 landscape,
//          ES8311 audio codec, PCF85063A RTC). Zasilanie: 1x Samsung INR18650-35E.
//
//  Arduino IDE: plytka "ESP32S3 Dev Module", Flash 8MB, partycja "8M with spiffs".
//  Pliki obok .ino: photo_font.h  (+ MP3 budzikow na partycji danych: /alarm1..3.mp3)
//
//  Biblioteki (dokladne nazwy + wersje):
//    - U8g2                 by oliver    >= 2.35.x  (ST7305 400x300 HW-SPI)
//    - ESP32 Arduino core   3.x          (esp_task_wdt v3, esp_adc/*, esp_sntp)
//    - ESP32-audioI2S       by schreibfaul1  3.4.5  (MP3 -> ES8311 przez I2S)
//    Wbudowane w core: WiFi, WebServer, Preferences, Wire, SPI, FS/SPIFFS/LittleFS/FFat.
//
//  PRIORYTETY (w kolejnosci): 1) dokladnosc czasu, 2) czas pracy na baterii,
//  3) stabilnosc/odpornosc na bledy WiFi/NTP/RTC, 4) czytelnosc i rozwoj.
//
//  OGRANICZENIA DOKLADNOSCI (uczciwie — nie udajemy dokladnosci, ktorej sprzet
//  nie ma):
//    - NTP daje ms w chwili sync, ale RTC ustawiamy z dokladnoscia do GRANICY
//      SEKUNDY (writeRtc wyrownuje faze). Absolutny blad ~+-0.5..1 s przy sync.
//    - Miedzy synchronizacjami liczy PCF85063A. Po sprzetowej korekcji offsetu
//      (rejestr 0x02 = 0x7B, -5 LSB ~ -21.7 ppm) resztkowy dryf jest rzedu
//      <1 s/dobe (zalezny od temperatury — NIE deklarujemy sztywnej liczby).
//    - Ekran glowny pokazuje HH:MM (bez sekund), wiec dryf sub-minutowy jest
//      niewidoczny; przewrot minuty wyrownany do sekundy RTC przy kazdym wybudzeniu.
//    => Praktycznie zegar trzyma sie w granicach ~1 s przez cala dobe. Brak PPS
//       w tym sprzecie => sub-sekundowej dyscypliny nie symulujemy.
//
//  MODEL ENERGII (skrot): podswietlenia brak (panel refleksyjny) => 0 mA bazy.
//    DZIEN  = light-sleep do granicy minuty (panel trzyma obraz, setup() sie nie
//             powtarza -> brak mrugania), ~1 mA srednio.
//    NOC 23:59-06:00 = deep-sleep do 06:00 / najblizszego budzika, ekran zgaszony
//             (refleksyjny LCD bez podswietlenia i tak nieczytelny w ciemnosci).
//    ECO  <=15% = wstrzymanie auto-WiFi/NTP (najwiekszy pobor); zegar z RTC.
//    KRYT <=3.05 V = ochronny deep-sleep (ochrona ogniwa + FLASH przed brownoutem).
//    WiFi tylko na czas synchronizacji/panelu WWW, potem WIFI_OFF. BT nigdy nieuzywany.
// ============================================================================

#include <Arduino.h>
#include <WiFi.h>
#include <WebServer.h>
#include <Preferences.h>
#include <Wire.h>
#include <atomic>
#include <ctype.h>
#include <limits.h>
#include <time.h>
#include <sys/time.h>
#include <FS.h>
#include <SPIFFS.h>
#include <LittleFS.h>
#include <FFat.h>
#include <U8g2lib.h>
#include <SPI.h>
#include <Audio.h>
#include <esp_adc/adc_oneshot.h>
#include <esp_adc/adc_cali.h>
#include <esp_adc/adc_cali_scheme.h>
#include <esp_sleep.h>
#include <driver/gpio.h>
#include <driver/rtc_io.h>
#include "esp_sntp.h"
#include "esp_task_wdt.h"
#include "esp_system.h"

#include "photo_font.h"

// Deklaracje wyprzedzajace struktur uzywanych w sygnaturach funkcji PRZED ich
// pierwsza definicja (Arduino auto-generuje prototypy i wstawia je tuz przed
// pierwsza definicja funkcji). Bez nich kompilator zglasza "not declared".
struct AlarmConfig;
struct DrainState;

// ============================================================================
//  [0] WERSJA, BUILD INFO, FLAGI FUNKCJI
// ============================================================================
#define FW_NAME        "Zegar NTP RLCD"
#define FW_VERSION     "6.0"
#define FW_BUILD_DATE  __DATE__
#define FW_BUILD_TIME  __TIME__

// 1=wlaczone, 0=wylaczone (#if usuwa kod z kompilacji -> zero narzutu gdy off).
#define ENABLE_WATCHDOG            1   // sprzetowy reset po zawieszeniu petli (TWDT)
#define ENABLE_LOW_BATTERY_PROTECT 1   // ochrona ogniwa: degradacja + ochronny sen
#define ENABLE_DIAGNOSTICS         1   // strona /info + ekranowa DIAGNOSTYKA, liczniki resetow

// ============================================================================
//  Watchdog zadania (TWDT)
//  Timeout MUSI byc > najdluzszy light-sleep dzienny (60 s). W light-sleep licznik
//  TWDT zwykle stoi (APB bramkowany), ale margines gwarantuje brak falszywego
//  resetu niezaleznie od wersji rdzenia. Realne zawieszenie petli i tak zostaje
//  wylapane. Dlugie operacje blokujace (upload MP3, laczenie WiFi) jawnie karmia
//  watchdog. Deep-sleep RESETUJE chip -> TWDT startuje od nowa w setup().
// ============================================================================
constexpr uint32_t WDT_TIMEOUT_S = 90;

static inline void watchdogSetup() {
#if ENABLE_WATCHDOG
  #if defined(ESP_ARDUINO_VERSION_MAJOR) && ESP_ARDUINO_VERSION_MAJOR >= 3
    esp_task_wdt_config_t cfg = {};
    cfg.timeout_ms     = WDT_TIMEOUT_S * 1000U;
    cfg.idle_core_mask = 0;        // nie nadzoruj IDLE (sny sa celowe) — tylko loopTask
    cfg.trigger_panic  = true;     // timeout -> panic -> reset (odzysk bez nadzoru)
    if (esp_task_wdt_init(&cfg) == ESP_ERR_INVALID_STATE) {
      esp_task_wdt_reconfigure(&cfg);
    }
  #else
    esp_task_wdt_init(WDT_TIMEOUT_S, true);
  #endif
  esp_task_wdt_add(NULL);
  esp_task_wdt_reset();
#endif
}

static inline void watchdogFeed() {
#if ENABLE_WATCHDOG
  esp_task_wdt_reset();
#endif
}

// Detektor brownout: ESP32-S3 ma sprzetowy brownout-detector wlaczany przez rdzen
// (~2.51 V). CELOWO zostaje WLACZONY — przy zalamaniu napiecia natychmiast resetuje
// uklad, chroniac FLASH przed uszkodzeniem w trakcie zapisu. Progu nie zmieniamy
// (brak API w szkicu .ino). Programowa ochrona ogniwa usypia juz przy ~3.05 V,
// duzo powyzej progu sprzetowego. Kazdy reset brownout jest zliczany (/info).

// ============================================================================
//  power_runtime — estymator zuzycia baterii. Czysta arytmetyka na probkach SoC,
//  bez zaleznosci od sprzetu. Dane cosmetyczne dla /info i strony DIAGNOSTYKA.
// ============================================================================
#ifndef DRAIN_CAP_MAH
#define DRAIN_CAP_MAH        3400
#endif
#define DRAIN_CHARGE_HYST    5         // wzrost SoC% liczony jako "doladowano" -> reset kotwicy
#define DRAIN_MIN_WINDOW_SEC 43200     // min. 12 h danych (plaskie plateau Li-ion = szum ADC; dluzsze okno usrednia)
#define DRAIN_MIN_DSOC       2         // min. spadek SoC%, by estymata miala sens (ponizej = szum)

struct DrainState {
  bool     valid;
  int64_t  anchorEpoch;
  uint8_t  anchorSoc;
  int64_t  lastEpoch;
  uint8_t  lastSoc;
};

static inline void drainReset(DrainState &d, int64_t epoch, uint8_t soc) {
  d.valid = true;
  d.anchorEpoch = epoch; d.anchorSoc = soc;
  d.lastEpoch   = epoch; d.lastSoc   = soc;
}

static inline void drainOnSample(DrainState &d, int64_t epoch, uint8_t soc) {
  if (!d.valid) { drainReset(d, epoch, soc); return; }
  if (soc > d.anchorSoc + DRAIN_CHARGE_HYST || soc > d.lastSoc + DRAIN_CHARGE_HYST) {
    drainReset(d, epoch, soc); return;   // wykryto ladowanie -> restart okna
  }
  d.lastEpoch = epoch; d.lastSoc = soc;
}

