Rubikrubi/zegar-WAVESHARE-ESP32-S3-4-2-cala-RLCD/zegar-WAVESHARE-ESP32-S3-4-2-cala-RLCD v6.0.ino
// mAh/dobe. <0 => za malo danych; 0 => brak mierzalnego zuzycia.
static inline float drainMahPerDay(const DrainState &d) {
  if (!d.valid) return -1.0f;
  int64_t dt = d.lastEpoch - d.anchorEpoch;
  if (dt < DRAIN_MIN_WINDOW_SEC) return -1.0f;
  int dSoc = (int)d.anchorSoc - (int)d.lastSoc;
  if (dSoc < DRAIN_MIN_DSOC) return 0.0f;
  return (dSoc / 100.0f) * (float)DRAIN_CAP_MAH / (dt / 86400.0f);
}

// Dni do rozladowania przy biezacym tempie. <0 => nieznane.
static inline float drainDaysRemaining(const DrainState &d, uint8_t curSoc) {
  float perDay = drainMahPerDay(d);
  if (perDay <= 0.0f) return -1.0f;
  return (curSoc / 100.0f) * (float)DRAIN_CAP_MAH / perDay;
}

// ============================================================================
//  [1] KONFIGURACJA — adresy I2C, kalibracja RTC, piny, stale, TZ, serwery, WiFi
// ============================================================================
#define ES8311_ADDR        0x18
#define PCF85063A_ADDR     0x51
#define RTC_FORMAT_MARKER  0xA5

// --- Kalibracja dryftu krysztalu RTC (rejestr Offset 0x02 PCF85063A) ---------
// ZNAK OFFSETU (datasheet NXP PCF85063A rev.7 sek. 8.2.3 + Linux rtc-pcf85063.c):
//   offset DODATNI spowalnia zegar (wydluza sekunde); offset UJEMNY przyspiesza.
//   Offset[LSB] = blad_ppm / 4.34;  1 ppm = 0.0864 s/dobe.
// Zmierzony surowy dryft -2 s/24h (krysztal ZA WOLNY ~-23.1 ppm). Korekcja:
//   -23.1/4.34 = -5.3 -> -5 LSB = -21.7 ppm; reszta ~-1.4 ppm ~ -0.12 s/24h.
//   -5 w U2 na 7 bitach, MODE=0 (bit7) = 0x7B. Weryfikacja odczytem zwrotnym.
#define RTC_OFFSET_REG            0x02
#define RTC_OFFSET_VALUE          0x7B    // -5 LSB, MODE=0 (-21.7 ppm; przyspiesza zegar)
#define RTC_OFFSET_LSB_PPM_MODE0  4.34f
#define RTC_OFFSET_LSB_PPM_MODE1  4.069f
#define RTC_OFFSET_RETRIES        4
#define PPM_SEC_PER_DAY           0.0864f

// --- Piny: wyswietlacz RLCD (HARDWARE SPI; SPI.begin w setupDisplay) ----------
#define RLCD_SCK_PIN   11
#define RLCD_MOSI_PIN  12
#define RLCD_DC_PIN    5
#define RLCD_CS_PIN    40
#define RLCD_RST_PIN   41
#define LCD_WIDTH      400
#define LCD_HEIGHT     300

// --- Piny: I2C (kodek + RTC), audio I2S, przyciski, akumulator ----------------
#define I2C_SDA_PIN    13
#define I2C_SCL_PIN    14
#define RTC_INT_PIN    15

#define I2S_MCLK_PIN   16
#define I2S_BCLK_PIN   9
#define I2S_WS_PIN     45
#define I2S_DOUT_PIN   8
#define PA_ENABLE_PIN  46

#define KEY_PIN            18   // krotko: wycisz budzik / wlacz panel WWW; dlugo: nic
#define PREVIEW_BUTTON_PIN 0    // krotko: podglad najblizszego budzika

#define BATTERY_ADC_CHANNEL          ADC_CHANNEL_3   // = GPIO4 na ESP32-S3
#define BATTERY_DIVIDER_RATIO        3.0f
#define BATTERY_VOLTAGE_CALIBRATION  1.017f
#define BATTERY_CAPACITY_MAH         3400    // Samsung INR18650-35E
#define BATTERY_SAMPLE_COUNT         16
#define BATTERY_EMPTY_VOLTAGE        3.00f
#define BATTERY_FULL_VOLTAGE         4.20f
#define BATTERY_FULL_FLOOR           99
#define BATTERY_FULL_HOLD_FLOOR      98
#define BATTERY_READ_INTERVAL_MS     (10UL * 60UL * 1000UL)
#define BATTERY_BUSY_RETRY_MS        (30UL * 1000UL)

// --- Ochrona niskiego stanu ogniwa (dwustopniowa) -----------------------------
//  LOW: degradacja — wstrzymaj auto-NTP/WiFi (najwiekszy pobor); zegar dalej chodzi.
//  CRITICAL: ochronny deep-sleep — nie rozladowac Li-ion ponizej bezpiecznego
//  progu i nie wywolac brownoutu. Progi mierzone w spoczynku (OCV).
constexpr uint8_t  BATTERY_LOW_PERCENT          = 15;
constexpr float    BATTERY_CRITICAL_VOLTAGE     = 3.05f;
constexpr uint8_t  BATTERY_CRITICAL_PERCENT     = 3;
constexpr uint32_t BATTERY_CRITICAL_RECHECK_SEC = 30UL * 60UL;

// --- Parametry logiki zegara / budzikow ---------------------------------------
constexpr int      ALARM_COUNT                = 3;
constexpr int      SOUND_COUNT                = 3;
constexpr int      MAX_AUDIO_VOLUME           = 21;
constexpr uint8_t  DEFAULT_AUDIO_VOLUME       = 10;
constexpr uint8_t  CODEC_VOLUME_PERCENT       = 100;
constexpr uint32_t ALARM_LATE_WINDOW_SEC      = 20;
constexpr uint32_t RING_RETRY_MS              = 3000;
constexpr uint32_t RING_MIN_PLAY_MS           = 750;
constexpr uint8_t  RING_MAX_ERRORS            = 10;
constexpr uint32_t RING_TIMEOUT_MS            = 15UL * 60UL * 1000UL;

constexpr uint32_t WEB_WINDOW_MS              = 5UL * 60UL * 1000UL;
constexpr uint32_t WEB_WIFI_GRACE_MS          = 10000;
constexpr uint32_t WIFI_HINT_FALLBACK_MS      = 5000;
constexpr uint32_t NTP_WIFI_TIMEOUT_MS        = 15000;
constexpr uint32_t NTP_PACKET_TIMEOUT_MS      = 50000;  // lwIP SNTP probuje 3 serwery co ~15 s -> 50 s pokrywa wszystkie
constexpr uint32_t NTP_ALARM_CATCHUP_SEC      = 90;

// Backoff dla nieudanego auto-NTP (zamiast wiecznego retry co 5 min). Po serii
// szybkich ponowien (cold boot) przechodzi w backoff rosnacy 1 min -> 1 h, by
// przy trwalym braku WiFi NIE palic radia bez konca. Reset po sukcesie.
constexpr uint32_t NTP_QUICK_RETRY_MS         = 30000;        // 30 s — seria szybka po starcie
constexpr uint32_t NTP_BACKOFF_MIN_MS         = 60000;        // 1 min
constexpr uint32_t NTP_BACKOFF_MAX_MS         = 3600000;      // 1 h

constexpr int      NTP_HOUR                   = 10;  // codzienna synchronizacja 10:00-10:05 (+ dogonienie do 23:00)
constexpr int      NTP_MIN_WINDOW             = 5;
constexpr uint32_t RTC_WRITE_RETRY_MS         = 5000;
constexpr uint8_t  RTC_WRITE_RETRIES          = 12;
constexpr int      RTC_WAKE_MAX_SKEW_SEC      = 30;

constexpr uint32_t DAY_CPU_MHZ                = 160;
constexpr uint32_t NIGHT_CPU_MHZ              = 40;
#define POWER_DOWN_FLASH_IN_SLEEP 0   // 1=odlacz flash (VDD_SDIO) w light-sleep -> najwiekszy spadek pradu bazowego.
                                      //   NIETESTOWANE na tej plytce (na innej = reboot/niestabilnosc). Zostaje 0.
                                      //   Przyszla optymalizacja: zmierzyc na sprzecie zanim wlaczysz.
#define FAST_NTP_RECONNECT 1          // 1=uzyj zapamietanego kanalu+BSSID (krocej radia)
#define ST7305_STATIC_LPM 0           // 0=WYLACZONE. Tryb LPM panelu — nieprzetestowana komenda; nie wysylamy bez testu.

constexpr uint64_t IDLE_LIGHT_SLEEP_US        = 900000ULL;    // fallback gdy czas nieznany
constexpr uint64_t IDLE_LIGHT_SLEEP_MAX_SEC   = 60ULL;        // sen do granicy minuty -> 1 wybudzenie/min
constexpr int      NIGHT_START_HOUR           = 23;
constexpr int      NIGHT_START_MIN            = 59;
constexpr int      NIGHT_END_HOUR             = 6;
constexpr int      NIGHT_END_MIN              = 0;
constexpr uint32_t NIGHT_MIN_SLEEP_SEC        = 5;
constexpr uint32_t NIGHT_FALLBACK_CHUNK_SEC   = 3600;         // maks. odcinek snu gdy alarm RTC nie uzbroil sie (budzenie timerem RC)
constexpr uint32_t NIGHT_FALLBACK_ALARM_CHUNK_SEC = 300;      // jw. gdy najblizszy jest budzik: krocej -> dryft RC << okno wylapania

