Rubikrubi/zegar-WAVESHARE-ESP32-S3-4-2-cala-RLCD/zegar-WAVESHARE-ESP32-S3-4-2-cala-RLCD v6.0.ino
// Diagnostyka — RTC RAM (jeden cykl pracy ogniwa), zerowana na cold boot.
static RTC_DATA_ATTR uint16_t g_bootCount;
static RTC_DATA_ATTR int64_t  g_coldBootEpoch;
static RTC_DATA_ATTR int32_t  g_lastRtcDriftSec;
static RTC_DATA_ATTR int64_t  g_lastNtpSyncEpoch;
static RTC_DATA_ATTR int64_t  g_prevNtpSyncEpoch;
// Kalibracja offsetu RTC (ustawiane przy kazdym starcie w rtcEnsureOffsetCalibration).
static uint8_t g_rtcOffsetRaw      = 0xFF;
static int8_t  g_rtcOffsetLsb      = 0;
static float   g_rtcOffsetPpm      = 0.0f;
static bool    g_rtcOffsetVerified = false;
// Dozywotnie liczniki "zlych" resetow — w NVS (zdarzenia rzadkie).
static uint32_t g_brownoutResets = 0;
static uint32_t g_wdtResets      = 0;
static uint32_t g_panicResets    = 0;

// Stan "dzwonienia" budzika.
static bool     ringing = false;
static int      ringingAlarm = -1;
static uint32_t ringStartMs = 0;
static uint32_t ringLastRetryMs = 0;
static uint8_t  ringErrors = 0;
static uint32_t soundStartedMs = 0;

static int lastDrawMinute = -1;
static int lastDrawDay = -1;
static uint32_t lastClockSig = 0xFFFFFFFFu;   // sygnatura widocznej tresci (sentinel = wymus repaint)

// Dedup wyzwolen budzikow — przezywa deep-sleep, zerowany na cold boot.
static RTC_DATA_ATTR int lastTriggerDay[ALARM_COUNT];
// Znacznik dnia dobowej synchronizacji NTP 10:00 (RTC RAM -> wybudzenie z
// deep-sleep nie wywoluje powtornego sync tego samego dnia).
static RTC_DATA_ATTR int ntpStartedDay;
// Znacznik dnia porannego NTP po wybudzeniu o 06:00 (drugie dobowe synchro).
static RTC_DATA_ATTR int ntpMorningDay;

static uint8_t  ntpRetriesLeft = 0;
static uint32_t ntpNextRetryMs = 0;
static uint32_t ntpBackoffMs   = NTP_BACKOFF_MIN_MS;
static uint8_t  rtcWriteRetriesLeft = 0;
static uint32_t rtcWriteNextRetryMs = 0;
static uint32_t batteryNextReadMs = 0;

static bool     keyRaw = HIGH, keyStable = HIGH;
static uint32_t keyChangedMs = 0, keyPressMs = 0;
static bool     keyLongFired = false;
static bool     bootRaw = HIGH, bootStable = HIGH;
static uint32_t bootChangedMs = 0, bootPressedMs = 0;
static bool     previewActive = false;
static uint32_t previewUntilMs = 0;

static const gpio_num_t HOLD_PINS[] = {
  (gpio_num_t)RLCD_DC_PIN, (gpio_num_t)RLCD_CS_PIN, (gpio_num_t)RLCD_SCK_PIN,
  (gpio_num_t)RLCD_MOSI_PIN, (gpio_num_t)RLCD_RST_PIN
};

// Prototypy (funkcje uzywane przed definicja).
static void stopPlayback(bool userStopped);
static bool startSound(uint8_t soundIndex, uint8_t volume);
static void startRinging(int alarmIndex);
static bool ensureCodec();
static void shutdownCodec();
static void updateBattery(bool force);
static bool syncNtp(bool manual);
static bool serviceNtp();
static void checkAlarms(uint32_t lateWindowSec = ALARM_LATE_WINDOW_SEC);
static void enterNightSleepIfNeeded(bool force);
static void showPreview();
static bool startWebWindow();
static void restoreTimeAfterFailedNtp();
static void drawCriticalBatteryPage();
#if ENABLE_LOW_BATTERY_PROTECT
static bool batteryLow();
static bool batteryCritical();
static void enterCriticalBatterySleepIfNeeded();
#endif

// ============================================================================
//  [3] CZAS — konwersje cywilne i RTC PCF85063A
// ============================================================================
static int daysFromCivil(int y, unsigned m, unsigned d) {
  y -= m <= 2;
  const int era = (y >= 0 ? y : y - 399) / 400;
  const unsigned yoe = (unsigned)(y - era * 400);
  const unsigned doy = (153 * (m + (m > 2 ? -3 : 9)) + 2) / 5 + d - 1;
  const unsigned doe = yoe * 365 + yoe / 4 - yoe / 100 + doy;
  return era * 146097 + (int)doe - 719468;
}

static time_t utcEpochFromCivil(int y, int mo, int d, int h, int mi, int s) {
  return (time_t)daysFromCivil(y, (unsigned)mo, (unsigned)d) * 86400 + h * 3600 + mi * 60 + s;
}

static int localDayKey(const struct tm &t) {
  return (t.tm_year + 1900) * 400 + t.tm_yday;
}

static bool isNightMode(const struct tm &t) {
  int now = t.tm_hour * 60 + t.tm_min;
  int start = NIGHT_START_HOUR * 60 + NIGHT_START_MIN;
  int end   = NIGHT_END_HOUR * 60 + NIGHT_END_MIN;
  if (start < end) return now >= start && now < end;
  if (start > end) return now >= start || now < end;
  return false;
}

static bool isSupportedEpoch(time_t epoch) {
  if (epoch < 1700000000) return false;
  struct tm gm;
  gmtime_r(&epoch, &gm);
  int year = gm.tm_year + 1900;
  return year >= 2024 && year <= 2099;
}

static bool getLocalTm(struct tm *out) {
  time_t now = time(nullptr);
  if (!isSupportedEpoch(now)) return false;
  localtime_r(&now, out);
  return true;
}

static void setSystemEpoch(time_t epoch) {
  struct timeval tv = { .tv_sec = epoch, .tv_usec = 0 };
  settimeofday(&tv, nullptr);
}

static time_t epochForClock(struct tm base, int h, int mi, int s, int addDays) {
  base.tm_hour = h; base.tm_min = mi; base.tm_sec = s;
  base.tm_mday += addDays;     // mktime normalizuje przepelnienie
  base.tm_isdst = -1;          // mktime sam ustali DST
  return mktime(&base);        // poprawne przez noc zmiany czasu (doba != 86400 s)
}

static bool alarmDueNow(const struct tm &nowTm, time_t now, uint8_t h, uint8_t mi,
                        uint8_t s, uint32_t lateWindowSec, int *occurrenceDay) {
  time_t alarmAt = epochForClock(nowTm, h, mi, s, 0);
  if (alarmAt > now) alarmAt = epochForClock(nowTm, h, mi, s, -1);
  time_t delaySec = now - alarmAt;
  if (delaySec < 0 || (uint64_t)delaySec > lateWindowSec) return false;
  if (occurrenceDay) {
    struct tm alarmTm;
    localtime_r(&alarmAt, &alarmTm);
    *occurrenceDay = localDayKey(alarmTm);
  }
  return true;
}

static uint8_t bcd2dec(uint8_t v) { return (v >> 4) * 10 + (v & 0x0F); }
static uint8_t dec2bcd(uint8_t v) { return (uint8_t)(((v / 10) << 4) | (v % 10)); }
static bool    validBcd(uint8_t v) { return (v & 0x0F) <= 9 && ((v >> 4) & 0x0F) <= 9; }
static bool    leapYear(int y) { return (y % 4 == 0 && y % 100 != 0) || (y % 400 == 0); }

static uint8_t daysInMonth(int y, int m) {
  static const uint8_t md[] = { 31,28,31,30,31,30,31,31,30,31,30,31 };
  if (m == 2 && leapYear(y)) return 29;
  return md[m - 1];
}

static bool validDateTime(int y, int mo, int d, int h, int mi, int s) {
  if (y < 2024 || y > 2099 || mo < 1 || mo > 12) return false;
  if (d < 1 || d > daysInMonth(y, mo)) return false;
  return h >= 0 && h <= 23 && mi >= 0 && mi <= 59 && s >= 0 && s <= 59;
}

static bool rtcBeginSession() {
  Wire.begin(I2C_SDA_PIN, I2C_SCL_PIN);
  Wire.setClock(400000);
  Wire.beginTransmission(PCF85063A_ADDR);
  return Wire.endTransmission() == 0;
}

static bool rtcWriteReg(uint8_t reg, uint8_t value) {
  Wire.beginTransmission(PCF85063A_ADDR);
  Wire.write(reg);
  Wire.write(value);
  return Wire.endTransmission() == 0;
}

// Odczyt n rejestrow od 'reg' jednym transferem. Wolajacy juz otworzyl sesje.
static bool rtcReadRegs(uint8_t reg, uint8_t *buf, uint8_t n) {
  Wire.beginTransmission(PCF85063A_ADDR);
  Wire.write(reg);
  if (Wire.endTransmission(false) != 0) return false;
  if (Wire.requestFrom((uint8_t)PCF85063A_ADDR, n) != n) return false;
  for (uint8_t i = 0; i < n; i++) buf[i] = Wire.read();
  return true;
}

static bool rtcReadControl1(uint8_t *control1) {
  if (!control1 || !rtcBeginSession()) return false;
  return rtcReadRegs(0x00, control1, 1);
}
static bool rtcReadControl2(uint8_t *control2) {
  if (!control2 || !rtcBeginSession()) return false;
  return rtcReadRegs(0x01, control2, 1);
}
static bool rtcWriteControl1(uint8_t control1) { return rtcWriteReg(0x00, control1); }

static bool rtcReleaseClock(uint8_t runningControl1) {
  for (uint8_t attempt = 0; attempt < 3; attempt++) {
    if (rtcWriteControl1(runningControl1)) return true;
    delay(2);
  }
  return false;
}

// Zatrzymaj licznik przed ustawieniem czasu. STOP zeruje glowna czesc preskalera
// -> pierwszy impuls sekundowy ma okreslona faze.
static bool rtcPrepareTimeWrite(uint8_t *runningControl1) {
  if (!runningControl1) return false;
  uint8_t control1;
  if (!rtcReadControl1(&control1)) return false;
  *runningControl1 = control1 & (uint8_t)~((1U << 7) | (1U << 5) | (1U << 2) | (1U << 1));
  if (rtcWriteControl1(*runningControl1 | (1U << 5))) return true;
  rtcReleaseClock(*runningControl1);
  return false;
}

static bool rtcHasCurrentFormat() {
  uint8_t marker;
  return rtcReadRegs(0x03, &marker, 1) && marker == RTC_FORMAT_MARKER;
}
static bool rtcStoreCurrentFormat()      { return rtcWriteReg(0x03, RTC_FORMAT_MARKER); }
static bool rtcInvalidateCurrentFormat() { return rtcWriteReg(0x03, 0); }

// Odczyt 7 rejestrow czasu (0x04..0x0A) jednym transferem -> brak rwania na granicy
// sekundy. Rok 00..99 = 2000..2099 (zgodnosc z liczeniem lat przestepnych w PCF85063A).
static bool readRtcEpochInternal(time_t *epoch, bool requireCurrentFormat) {
  if (!epoch) return false;
  uint8_t control1;
  if (!rtcReadControl1(&control1)) return false;

