Rubikrubi/zegar-WAVESHARE-ESP32-S3-4-2-cala-RLCD/zegar-WAVESHARE-ESP32-S3-4-2-cala-RLCD v6.0.ino
  // Nie wznawiaj po cichu zatrzymanego/przestawionego RTC (staly czas != aktualny).
  const uint8_t invalidModeMask = (1U << 7) | (1U << 5) | (1U << 1);
  if ((control1 & invalidModeMask) != 0 ||
      (requireCurrentFormat && !rtcHasCurrentFormat())) return false;

  uint8_t t[7];
  if (!rtcReadRegs(0x04, t, 7)) return false;
  uint8_t secReg = t[0], minReg = t[1], hourReg = t[2], dayReg = t[3];
  uint8_t monReg = t[5], yearReg = t[6];   // t[4] = dzien tygodnia (pomijamy)

  bool oscStopped = (secReg & 0x80) != 0;
  secReg &= 0x7F; minReg &= 0x7F; hourReg &= 0x3F; dayReg &= 0x3F; monReg &= 0x1F;

  if (oscStopped || !validBcd(secReg) || !validBcd(minReg) || !validBcd(hourReg) ||
      !validBcd(dayReg) || !validBcd(monReg) || !validBcd(yearReg)) return false;

  int s  = bcd2dec(secReg), mi = bcd2dec(minReg), h = bcd2dec(hourReg);
  int d  = bcd2dec(dayReg), mo = bcd2dec(monReg), y = bcd2dec(yearReg) + 2000;

  if (!validDateTime(y, mo, d, h, mi, s)) return false;
  *epoch = utcEpochFromCivil(y, mo, d, h, mi, s);
  return true;
}

static bool readRtcEpoch(time_t *epoch) { return readRtcEpochInternal(epoch, true); }

static bool readRtcToSystem() {
  for (uint8_t attempt = 0; attempt < 3; attempt++) {
    time_t epoch;
    if (readRtcEpoch(&epoch)) { setSystemEpoch(epoch); return true; }
    delay(2);
  }
  return false;
}

// Zapis czasu UTC do RTC z WYROWNANIEM do granicy sekundy. Po zwolnieniu STOP
// preskaler startuje od zera, wiec wpisana sekunda "trzyma sie" ~1.0 s -> faza
// przewrotu = chwila zwolnienia STOP. Bez tego RTC bywa stale spozniony 0.5-1 s,
// co po godzinach wyglada jak dryft. Pomijamy wyrownanie gdy gra audio/budzik
// (busy-wait do ~1 s przerwalby audio.loop()).
static bool writeRtc(time_t epoch) {
  if (!isSupportedEpoch(epoch)) return false;

  struct timeval tv;
  gettimeofday(&tv, nullptr);
  time_t writeEpoch = epoch;
  bool   alignToBoundary = false;
  if (!playing && !ringing &&
      isSupportedEpoch(tv.tv_sec) && (tv.tv_sec == epoch || tv.tv_sec + 1 == epoch)) {
    writeEpoch = tv.tv_sec + 1;          // najblizsza nadchodzaca pelna sekunda
    alignToBoundary = true;
  }

  struct tm gm;
  gmtime_r(&writeEpoch, &gm);
  int year = gm.tm_year + 1900;

  // Najpierw uniewaznij dane: reset w dowolnym dalszym miejscu nie ujawni
  // niepelnego zapisu jako poprawnego czasu.
  if (!rtcBeginSession()) return false;
  if (!rtcInvalidateCurrentFormat()) return false;
  uint8_t runningControl1;
  if (!rtcPrepareTimeWrite(&runningControl1)) return false;
  uint8_t yearReg = (uint8_t)(year % 100);

  Wire.beginTransmission(PCF85063A_ADDR);
  Wire.write(0x04);
  Wire.write(dec2bcd(gm.tm_sec) & 0x7F);            // OS=0 -> oscylator OK
  Wire.write(dec2bcd(gm.tm_min) & 0x7F);
  Wire.write(dec2bcd(gm.tm_hour) & 0x3F);
  Wire.write(dec2bcd(gm.tm_mday) & 0x3F);
  Wire.write((uint8_t)(gm.tm_wday & 0x07));
  Wire.write(dec2bcd((uint8_t)(gm.tm_mon + 1)) & 0x1F);
  Wire.write(dec2bcd(yearReg));
  if (Wire.endTransmission() != 0) { rtcReleaseClock(runningControl1); return false; }

  // Odczekaj do granicy docelowej sekundy (czas I2C wliczony), potem zwolnij STOP.
  if (alignToBoundary) {
    struct timeval nowTv;
    for (;;) {
      gettimeofday(&nowTv, nullptr);
      long remainingUs = (long)(writeEpoch - nowTv.tv_sec) * 1000000L - nowTv.tv_usec;
      if (remainingUs <= 0) break;
      if (remainingUs > 2000) delay(1); else delayMicroseconds((uint32_t)remainingUs);
    }
  }
  if (!rtcReleaseClock(runningControl1)) return false;

  time_t verifiedEpoch;
  if (!readRtcEpochInternal(&verifiedEpoch, false)) return false;
  long long diff = (long long)verifiedEpoch - (long long)writeEpoch;
  if (diff < -2 || diff > 2) return false;
  if (rtcStoreCurrentFormat() && rtcHasCurrentFormat()) return true;
  rtcInvalidateCurrentFormat();
  return false;
}

// --- Dekodowanie/kodowanie rejestru Offset (0x02) -----------------------------
static int8_t decodeRtcOffset(uint8_t raw) {
  int8_t v = (int8_t)(raw & 0x7F);
  if (v & 0x40) v -= 0x80;            // sign-extend (7-bit U2)
  return v;
}
static uint8_t encodeRtcOffset(int lsb, bool mode1) {
  if (lsb > 63)  lsb = 63;
  if (lsb < -64) lsb = -64;
  uint8_t reg = (uint8_t)(lsb & 0x7F);
  if (mode1) reg |= 0x80;
  return reg;
}
static float rtcOffsetPpm(int8_t lsb, bool mode1) {
  return (float)lsb * (mode1 ? RTC_OFFSET_LSB_PPM_MODE1 : RTC_OFFSET_LSB_PPM_MODE0);
}
// Sugerowana DOCELOWA wartosc offsetu po zmierzeniu dryfu (do /info — recznie):
//   delta_LSB = round( (driftSecPerDay / 0.0864) / 4.34 ); zwraca currentLsb + delta.
static int suggestedTotalOffsetLsb(float driftSecPerDay, int currentLsb) {
  float lsbF  = (driftSecPerDay / PPM_SEC_PER_DAY) / RTC_OFFSET_LSB_PPM_MODE0;
  int   delta = (int)(lsbF + (lsbF >= 0 ? 0.5f : -0.5f));
  int   total = currentLsb + delta;
  if (total > 63)  total = 63;
  if (total < -64) total = -64;
  return total;
}

// Kalibracja sprzetowa dryfu (rejestr 0x02) Z WERYFIKACJA odczytem zwrotnym.
// Niezalezna od rejestrow czasu i markera (writeRtc ich nie rusza), wiec wpis
// trwa przez kolejne synchronizacje. Wolana przy KAZDYM starcie: rejestr jest
// podtrzymywany bateryjnie, ale ponowny zapis+odczyt dowodzi, ze bajt wszedl.
static bool rtcEnsureOffsetCalibration() {
  g_rtcOffsetVerified = false;
  for (uint8_t attempt = 0; attempt < RTC_OFFSET_RETRIES; attempt++) {
    if (!rtcBeginSession()) { delay(2); continue; }
    rtcWriteReg(RTC_OFFSET_REG, RTC_OFFSET_VALUE);
    uint8_t raw;
    if (rtcReadRegs(RTC_OFFSET_REG, &raw, 1)) {
      g_rtcOffsetRaw = raw;
      g_rtcOffsetLsb = decodeRtcOffset(raw);
      g_rtcOffsetPpm = rtcOffsetPpm(g_rtcOffsetLsb, (raw & 0x80) != 0);
      if (raw == RTC_OFFSET_VALUE) { g_rtcOffsetVerified = true; return true; }
    }
    delay(2);
  }
  return false;
}

// INT sluzy wylacznie alarmowi wybudzajacemu. Wylacz korekcje, MI/HMI i countdown
// timer, skasuj flagi AF/TF, wylacz CLKOUT (mniejszy pobor RTC).
static bool rtcConfigureWakeInterrupt(bool alarmEnabled) {
  uint8_t control1;
  if (!rtcReadControl1(&control1)) return false;
  control1 &= (uint8_t)~(1U << 2);                   // CIE=0
  if (!rtcWriteReg(0x00, control1)) return false;
  if (!rtcWriteReg(0x11, 0x18)) return false;        // Timer_mode: TCF=1/60 Hz, TE=0, TIE=0
  if (!rtcWriteReg(0x10, 0)) return false;           // Timer_value
  uint8_t control2;
  if (!rtcReadControl2(&control2)) return false;
  control2 = (uint8_t)(0x07 | (alarmEnabled ? (1U << 7) : 0));   // COF=111 (CLKOUT off), AIE
  return rtcWriteReg(0x01, control2);
}

static bool rtcVerifyWakeInterruptConfig(bool alarmEnabled) {
  uint8_t control1, control2;
  if (!rtcReadControl1(&control1) || !rtcReadControl2(&control2)) return false;
  if (!rtcBeginSession()) return false;
  uint8_t timer[2];
  if (!rtcReadRegs(0x10, timer, 2)) return false;
  uint8_t expectedControl2 = alarmEnabled ? (1U << 7) : 0;
  return (control1 & (1U << 2)) == 0 &&
         (control2 & 0xF8) == expectedControl2 &&
         timer[0] == 0 && timer[1] == 0x18;
}

static bool rtcVerifyWakeAlarm(time_t epoch) {
  struct tm gm;
  gmtime_r(&epoch, &gm);
  if (!rtcBeginSession()) return false;
  uint8_t a[5];
  if (!rtcReadRegs(0x0B, a, 5)) return false;
  if (a[0] != (dec2bcd((uint8_t)gm.tm_sec) & 0x7F) ||
      a[1] != (dec2bcd((uint8_t)gm.tm_min) & 0x7F) ||
      a[2] != (dec2bcd((uint8_t)gm.tm_hour) & 0x3F) ||
      a[3] != (dec2bcd((uint8_t)gm.tm_mday) & 0x3F) ||
      a[4] != 0x80) return false;
  return rtcVerifyWakeInterruptConfig(true);
}

// Alarm PCF85063A pracuje w UTC (jak rejestry czasu). INT aktywne stanem niskim,
// niskie do skasowania flagi AF.
static bool rtcSetWakeAlarm(time_t epoch) {
  time_t systemNow = time(nullptr);
  if (!isSupportedEpoch(epoch) || !isSupportedEpoch(systemNow)) return false;
  time_t rtcNow;
  if (!readRtcEpoch(&rtcNow)) return false;     // odrzuca STOP/12h
  long long rtcSkew = (long long)rtcNow - (long long)systemNow;
  if (rtcSkew < -RTC_WAKE_MAX_SKEW_SEC || rtcSkew > RTC_WAKE_MAX_SKEW_SEC) return false;
  if (!rtcConfigureWakeInterrupt(false)) return false;

