Rubikrubi/zegar-WAVESHARE-ESP32-S3-4-2-cala-RLCD/zegar-WAVESHARE-ESP32-S3-4-2-cala-RLCD v6.0.ino
  struct tm gm;
  gmtime_r(&epoch, &gm);
  if (!rtcBeginSession()) return false;
  Wire.beginTransmission(PCF85063A_ADDR);
  Wire.write(0x0B);                               // Second_alarm..
  Wire.write(dec2bcd((uint8_t)gm.tm_sec) & 0x7F); // AEN=0 -> aktywny
  Wire.write(dec2bcd((uint8_t)gm.tm_min) & 0x7F);
  Wire.write(dec2bcd((uint8_t)gm.tm_hour) & 0x3F);
  Wire.write(dec2bcd((uint8_t)gm.tm_mday) & 0x3F);
  Wire.write(0x80);                               // Weekday_alarm AEN=1 (wylaczony)
  if (Wire.endTransmission() != 0) return false;

  if (!rtcConfigureWakeInterrupt(true)) return false;
  return rtcVerifyWakeAlarm(epoch);
}

static bool rtcDisableWakeAlarm() {
  return rtcConfigureWakeInterrupt(false) && rtcVerifyWakeInterruptConfig(false);
}

// ============================================================================
//  [4] USTAWIENIA (NVS) + DIAGNOSTYKA RESETU
// ============================================================================
static const char *NVS_NS = "zegar7";   // przestrzen nazw Preferences

static void setDefaultAlarms() {
  for (int i = 0; i < ALARM_COUNT; i++) {
    alarms[i].enabled = 0;
    alarms[i].hour = 7; alarms[i].minute = 0; alarms[i].second = 0;
    alarms[i].volume = DEFAULT_AUDIO_VOLUME;
    alarms[i].sound = (uint8_t)i;
    snprintf(alarms[i].label, sizeof(alarms[i].label), "Budzik %d", i + 1);
  }
}

static void resetTriggerState() {
  for (int i = 0; i < ALARM_COUNT; i++) lastTriggerDay[i] = -1;
}

static void sanitizeAlarm(AlarmConfig &alarm, int index) {
  alarm.enabled = alarm.enabled ? 1 : 0;
  if (alarm.hour > 23) alarm.hour = 7;
  if (alarm.minute > 59) alarm.minute = 0;
  if (alarm.second > 59) alarm.second = 0;
  if (alarm.volume > MAX_AUDIO_VOLUME) alarm.volume = DEFAULT_AUDIO_VOLUME;
  if (alarm.sound >= SOUND_COUNT) alarm.sound = (uint8_t)(index % SOUND_COUNT);
  alarm.label[sizeof(alarm.label) - 1] = '\0';
  if (alarm.label[0] == '\0')
    snprintf(alarm.label, sizeof(alarm.label), "Budzik %d", index + 1);
}

static void sanitizeAlarms() {
  for (int i = 0; i < ALARM_COUNT; i++) sanitizeAlarm(alarms[i], i);
}

static void loadSettings() {
  setDefaultAlarms();
  if (!prefs.begin(NVS_NS, false)) {
    strncpy(wifiSsid, DEFAULT_WIFI_SSID, sizeof(wifiSsid) - 1);
    strncpy(wifiPass, DEFAULT_WIFI_PASS, sizeof(wifiPass) - 1);
    wifiSsid[sizeof(wifiSsid) - 1] = 0; wifiPass[sizeof(wifiPass) - 1] = 0;
    return;
  }
  if (prefs.getBytesLength("alarms") == sizeof(alarms))
    prefs.getBytes("alarms", alarms, sizeof(alarms));
  sanitizeAlarms();
  String ssid = prefs.getString("ssid", DEFAULT_WIFI_SSID);
  String pass = prefs.getString("pass", DEFAULT_WIFI_PASS);
  if (ssid.length() == 0) { ssid = DEFAULT_WIFI_SSID; pass = DEFAULT_WIFI_PASS; }
  ssid.toCharArray(wifiSsid, sizeof(wifiSsid));
  pass.toCharArray(wifiPass, sizeof(wifiPass));
  prefs.end();
}

static void saveSettings() {
  if (!prefs.begin(NVS_NS, false)) return;
  prefs.putBytes("alarms", alarms, sizeof(alarms));
  prefs.putString("ssid", wifiSsid);
  prefs.putString("pass", wifiPass);
  prefs.end();
}

static const char *resetReasonText(esp_reset_reason_t r) {
  switch (r) {
    case ESP_RST_POWERON:   return "zasilanie (zimny start)";
    case ESP_RST_EXT:       return "zewnetrzny pin RST";
    case ESP_RST_SW:        return "software (esp_restart)";
    case ESP_RST_PANIC:     return "panic / wyjatek";
    case ESP_RST_INT_WDT:   return "watchdog przerwan";
    case ESP_RST_TASK_WDT:  return "watchdog zadania (TWDT)";
    case ESP_RST_WDT:       return "inny watchdog";
    case ESP_RST_DEEPSLEEP: return "deep-sleep (planowe)";
    case ESP_RST_BROWNOUT:  return "brownout (spadek napiecia)";
    case ESP_RST_SDIO:      return "SDIO";
    default:                return "nieznany";
  }
}

// Wczytaj dozywotnie liczniki resetow i — jesli ten rozruch to brownout/panic/WDT
// — zwieksz odpowiedni. Zdarzenia rzadkie, wiec zapis do flash bezpieczny.
static void recordResetReason(esp_reset_reason_t r) {
  if (!prefs.begin(NVS_NS, false)) return;
  g_brownoutResets = prefs.getUInt("rstBrown", 0);
  g_wdtResets      = prefs.getUInt("rstWdt",   0);
  g_panicResets    = prefs.getUInt("rstPanic", 0);
  if (r == ESP_RST_BROWNOUT)                                          prefs.putUInt("rstBrown", ++g_brownoutResets);
  else if (r == ESP_RST_TASK_WDT || r == ESP_RST_INT_WDT || r == ESP_RST_WDT) prefs.putUInt("rstWdt", ++g_wdtResets);
  else if (r == ESP_RST_PANIC)                                       prefs.putUInt("rstPanic", ++g_panicResets);
  prefs.end();
}

// ============================================================================
//  [5] WiFi + NTP — nieblokujaca maszyna stanow
//  Czas ustawiany z RTC pierwszy; NTP NADPISUJE tylko po REALNYM pakiecie
//  (gate atomic odroznia odpowiedz serwera od czasu wstepnie ustawionego z RTC).
//  WiFi wlaczane tylko na czas proby, potem WIFI_OFF. Nieudany sync = rollback.
// ============================================================================
static std::atomic<bool> g_ntpGotPacket{false};
static std::atomic<bool> g_ntpAcceptPacket{false};
static void onSntpSync(struct timeval *tv) {
  if (tv && g_ntpAcceptPacket.load(std::memory_order_acquire))
    g_ntpGotPacket.store(true, std::memory_order_release);
}

enum NtpSyncState : uint8_t { NTP_SYNC_IDLE, NTP_SYNC_WIFI_CONNECTING, NTP_SYNC_WAITING_PACKET };
static NtpSyncState ntpSyncState = NTP_SYNC_IDLE;
static bool         ntpManualAttempt = false;
static bool         ntpWifiHintActive = false;
static uint32_t     ntpStateStartedMs = 0;
static struct timeval ntpFallbackTime = {};   // snapshot czasu przed proba (rollback po bledzie)

static void stopSntpCallbacks() {
  g_ntpAcceptPacket.store(false, std::memory_order_release);
  if (esp_sntp_enabled()) esp_sntp_stop();
  sntp_set_time_sync_notification_cb(nullptr);
}

// Rollback po nieudanym NTP: przywroc czas sprzed proby (cala sekunda). Cala proba
// trwa <=65 s -> nie korygujemy ulamka (zbedna zlozonosc; sync i tak wroci w dobe).
static void restoreTimeAfterFailedNtp() {
  if (isSupportedEpoch(ntpFallbackTime.tv_sec)) settimeofday(&ntpFallbackTime, nullptr);
  else setSystemEpoch(0);
}

static void stopWifiAndNtp() {
  bool wasAttempting = ntpSyncState != NTP_SYNC_IDLE;   // przerywamy trwajaca probe (WIFI_CONNECTING lub WAITING_PACKET)
  if (ntpSyncState == NTP_SYNC_WAITING_PACKET) restoreTimeAfterFailedNtp();
  stopSntpCallbacks();
  ntpSyncState = NTP_SYNC_IDLE;
  ntpManualAttempt = false;
  ntpWifiHintActive = false;
  g_ntpGotPacket.store(false, std::memory_order_release);
  // Przerwano probe, brak waznego czasu i brak zaplanowanego ponowienia -> zaplanuj
  // jedno (backoff), by zegar w koncu zdobyl czas mimo przerwania (np. zamkniecie WWW).
  if (wasAttempting && ntpRetriesLeft == 0 && !isSupportedEpoch(time(nullptr))) {
    ntpRetriesLeft = 1;
    ntpNextRetryMs = millis() + ntpBackoffMs;
  }
  WiFi.disconnect(false, false);
  WiFi.mode(WIFI_OFF);
}

