Rubikrubi/zegar-WAVESHARE-ESP32-S3-4-2-cala-RLCD/zegar-WAVESHARE-ESP32-S3-4-2-cala-RLCD v6.0.ino
static bool wifiBeginSmart() {
  WiFi.persistent(false);
#if FAST_NTP_RECONNECT
  if (g_wifiHint) { WiFi.begin(wifiSsid, wifiPass, g_wifiChannel, g_wifiBssid); return true; }
#endif
  WiFi.begin(wifiSsid, wifiPass);
  return false;
}

static void wifiRetryFullScan() {
#if FAST_NTP_RECONNECT
  g_wifiHint = false;
#endif
  WiFi.disconnect(false, false);
  WiFi.begin(wifiSsid, wifiPass);
}

static void wifiCacheHint() {
#if FAST_NTP_RECONNECT
  if (WiFi.status() == WL_CONNECTED) {
    g_wifiChannel = WiFi.channel();
    const uint8_t *b = WiFi.BSSID();
    if (b) { for (int i = 0; i < 6; i++) g_wifiBssid[i] = b[i]; g_wifiHint = true; }
  }
#endif
}

// Blokujace laczenie WiFi (tylko sciezka panelu WWW; NTP laczy sie nieblokujaco).
static bool ensureWifi(uint32_t timeoutMs) {
  if (strlen(wifiSsid) == 0) return false;
  WiFi.mode(WIFI_STA);
  WiFi.setSleep(true);                 // modem-sleep -> mniejszy prad STA
  if (WiFi.status() != WL_CONNECTED) {
    bool usedHint = wifiBeginSmart();
    bool retriedFullScan = false;
    uint32_t start = millis();
    while (WiFi.status() != WL_CONNECTED && millis() - start < timeoutMs) {
      if (usedHint && !retriedFullScan && millis() - start >= WIFI_HINT_FALLBACK_MS) {
        retriedFullScan = true; wifiRetryFullScan();
      }
      delay(100); yield();
      watchdogFeed();                  // blokuje do ~15 s — nie pozwol na falszywy reset
    }
  }
  bool ok = WiFi.status() == WL_CONNECTED;
  if (ok) wifiCacheHint(); else g_wifiHint = false;
  return ok;
}

static void scheduleRtcWriteRetry(uint8_t retries = RTC_WRITE_RETRIES) {
  rtcWriteRetriesLeft = retries;
  rtcWriteNextRetryMs = millis() + RTC_WRITE_RETRY_MS;
}

static void handleRtcWriteRetry() {
  if (rtcWriteRetriesLeft == 0 || (int32_t)(millis() - rtcWriteNextRetryMs) < 0) return;
  if (writeRtc(time(nullptr))) {
    rtcWriteRetriesLeft = 0;
    ntpStatus = "NTP OK, RTC OK";
  } else if (--rtcWriteRetriesLeft > 0) {
    rtcWriteNextRetryMs = millis() + RTC_WRITE_RETRY_MS;
    ntpStatus = "NTP OK, RTC retry";
  } else {
    ntpStatus = "NTP OK, RTC ERR";
  }
  displayDirty = true;
}

static void finishNtpAttempt(bool ok) {
  bool wasManual = ntpManualAttempt;
  ntpSyncState = NTP_SYNC_IDLE;
  ntpManualAttempt = false;
  ntpWifiHintActive = false;
  stopSntpCallbacks();
  g_ntpGotPacket.store(false, std::memory_order_release);

  if (ok) {
    ntpRetriesLeft = 0;
    ntpBackoffMs = NTP_BACKOFF_MIN_MS;          // reset backoffu po sukcesie
  } else if (!wasManual) {
    if (ntpRetriesLeft > 0) {
      ntpNextRetryMs = millis() + NTP_QUICK_RETRY_MS;   // dokoncz serie szybka
    } else if (!isSupportedEpoch(time(nullptr))) {
      // Brak waznego czasu -> ponawiaj z BACKOFFEM (1 min -> 1 h), by przy trwalym
      // braku WiFi nie palic radia bez konca. Gdy czas wazny: brak retry, dogoni
      // nastepne okno dobowe.
      ntpRetriesLeft = 1;
      ntpNextRetryMs = millis() + ntpBackoffMs;
      ntpBackoffMs = (ntpBackoffMs >= NTP_BACKOFF_MAX_MS / 2) ? NTP_BACKOFF_MAX_MS : ntpBackoffMs * 2;
    }
  }
  if (!webActive) { WiFi.disconnect(false, false); WiFi.mode(WIFI_OFF); }
  displayDirty = true;
}

static void beginNtpRequest() {
  g_ntpAcceptPacket.store(false, std::memory_order_release);
  g_ntpGotPacket.store(false, std::memory_order_release);
  sntp_set_time_sync_notification_cb(onSntpSync);   // PRZED configTzTime
  sntp_set_sync_mode(SNTP_SYNC_MODE_IMMED);
  gettimeofday(&ntpFallbackTime, nullptr);
  g_ntpAcceptPacket.store(true, std::memory_order_release);
  configTzTime(TZ_POLAND, NTP_SERVER_1, NTP_SERVER_2, NTP_SERVER_3);
  ntpSyncState = NTP_SYNC_WAITING_PACKET;
  ntpStateStartedMs = millis();
  ntpStatus = "oczekiwanie na NTP";
  displayDirty = true;
}

static bool syncNtp(bool manual) {
  if (ntpSyncState != NTP_SYNC_IDLE) return false;
  if (manual) ntpRetriesLeft = 0;
  ntpManualAttempt = manual;
  ntpStatus = manual ? "manual: laczenie WiFi" : "auto: laczenie WiFi";
  displayDirty = true;

  if (strlen(wifiSsid) == 0) { ntpStatus = "brak SSID WiFi"; finishNtpAttempt(false); return false; }

  WiFi.mode(WIFI_STA);
  WiFi.setSleep(true);
  if (WiFi.status() == WL_CONNECTED) {
    beginNtpRequest();
  } else {
    ntpWifiHintActive = wifiBeginSmart();
    ntpSyncState = NTP_SYNC_WIFI_CONNECTING;
    ntpStateStartedMs = millis();
  }
  return true;
}

// Wolane co petle. Zwraca true gdy NTP wlasnie zatwierdzil nowy czas (dla okna
// budzika). Nigdy nie blokuje petli.
static bool serviceNtp() {
  if (ntpSyncState == NTP_SYNC_WIFI_CONNECTING) {
    if (WiFi.status() == WL_CONNECTED) {
      wifiCacheHint();
      beginNtpRequest();
    } else if (ntpWifiHintActive && millis() - ntpStateStartedMs >= WIFI_HINT_FALLBACK_MS) {
      ntpWifiHintActive = false;
      ntpStatus = "WiFi: pelny skan";
      wifiRetryFullScan();
      ntpStateStartedMs = millis();
      displayDirty = true;
    } else if (millis() - ntpStateStartedMs >= NTP_WIFI_TIMEOUT_MS) {
      ntpStatus = "blad WiFi";
      g_wifiHint = false;
      finishNtpAttempt(false);
    }
    return false;
  }

  if (ntpSyncState != NTP_SYNC_WAITING_PACKET) return false;

  if (g_ntpGotPacket.load(std::memory_order_acquire)) {
    stopSntpCallbacks();                       // zablokuj kolejny pakiet w trakcie zatwierdzania
    time_t syncedEpoch = time(nullptr);
    if (!isSupportedEpoch(syncedEpoch)) {
      restoreTimeAfterFailedNtp();
      ntpStatus = "bledny czas NTP";
      finishNtpAttempt(false);
      return false;
    }
    struct tm local = {};
    localtime_r(&syncedEpoch, &local);

#if ENABLE_DIAGNOSTICS
    { // Dryft: porownaj STARY czas RTC (jeszcze nienadpisany) z czasem NTP.
      time_t oldRtc;
      if (readRtcEpoch(&oldRtc)) g_lastRtcDriftSec = (int32_t)(oldRtc - syncedEpoch);
      g_prevNtpSyncEpoch = g_lastNtpSyncEpoch;
      g_lastNtpSyncEpoch = (int64_t)syncedEpoch;
    }
#else
    g_lastNtpSyncEpoch = (int64_t)syncedEpoch;
#endif

    bool rtcOk = writeRtc(syncedEpoch);
    if (rtcOk) rtcWriteRetriesLeft = 0; else scheduleRtcWriteRetry();
    char buf[48];
    snprintf(buf, sizeof(buf), "OK %02d:%02d:%02d RTC:%s",
             local.tm_hour, local.tm_min, local.tm_sec, rtcOk ? "OK" : "RETRY");
    ntpStatus = buf;
    ntpStartedDay = localDayKey(local);
    finishNtpAttempt(true);
    return true;
  }

  if (millis() - ntpStateStartedMs >= NTP_PACKET_TIMEOUT_MS) {
    stopSntpCallbacks();
    restoreTimeAfterFailedNtp();
    ntpStatus = "blad NTP";
    finishNtpAttempt(false);
  }
  return false;
}

static bool handleNtpRetry() {
  if (ntpSyncState != NTP_SYNC_IDLE) return true;
  if (ntpRetriesLeft == 0) return false;
  if ((int32_t)(millis() - ntpNextRetryMs) < 0) return true;
  --ntpRetriesLeft;
  syncNtp(false);
  return true;
}

// ============================================================================
//  System plikow (MP3 budzikow) — montowany leniwie
// ============================================================================
static bool recoverSoundFilesOnce() {
  File root = dataFS->open("/");
  if (!root) return false;
  for (File f = root.openNextFile(); f; f = root.openNextFile()) {
    bool isDir = f.isDirectory();
    String path = f.name();
    f.close();
    if (isDir) continue;
    if (!path.startsWith("/")) path = String("/") + path;
    String lower = path; lower.toLowerCase();
    if (lower.endsWith(".bak") && path.length() > 5) {
      String target = path.substring(0, path.length() - 4);
      bool changed = dataFS->exists(target) ? dataFS->remove(path) : dataFS->rename(path, target);
      if (changed) { root.close(); return true; }
    } else if (lower.endsWith(".part") && path.length() > 6) {
      String target = path.substring(0, path.length() - 5);
      String backup = target + ".bak";
      if (dataFS->exists(backup) && !dataFS->exists(target)) continue;
      if (dataFS->remove(path)) { root.close(); return true; }
    }
  }
  root.close();
  return false;
}

static void recoverSoundFiles() {
  if (!dataFS) return;
  for (uint8_t pass = 0; pass < 16 && recoverSoundFilesOnce(); pass++) {}
}

