Rubikrubi/zegar-WAVESHARE-ESP32-S3-4-2-cala-RLCD/zegar-WAVESHARE-ESP32-S3-4-2-cala-RLCD v6.0.ino
static bool ensureFsMounted() {
  if (fsMounted && dataFS) return true;
  struct { fs::FS *fs; const char *name; bool ok; } cands[] = {
    { &SPIFFS,   "SPIFFS",   SPIFFS.begin(false) },
    { &LittleFS, "LittleFS", false },
    { &FFat,     "FFat",     false },
  };
  if (!cands[0].ok) cands[1].ok = LittleFS.begin(false);
  if (!cands[0].ok && !cands[1].ok) cands[2].ok = FFat.begin(false);
  for (auto &c : cands) {
    if (c.ok) {
      fsMounted = true; dataFS = c.fs; dataFSName = c.name;
      recoverSoundFiles();
      Serial.printf("System plikow: %s\n", c.name);
      return true;
    }
  }
  // Fabrycznie czysty flash: MP3 mozna wgrac tylko przez WWW (wymaga FS) -> pat.
  // Jednorazowy format SPIFFS go przerywa; nic sie nie zamontowalo = brak danych.
  static bool formatTried = false;
  if (!formatTried) {
    formatTried = true;
    Serial.println("Brak FS - formatuje SPIFFS...");
    if (SPIFFS.begin(true)) {
      fsMounted = true; dataFS = &SPIFFS; dataFSName = "SPIFFS";
      Serial.println("System plikow: SPIFFS (nowo sformatowany)");
      return true;
    }
  }
  fsMounted = false; dataFS = nullptr; dataFSName = "brak";
  Serial.println("Brak systemu plikow z MP3");
  return false;
}

// ============================================================================
//  [6] AUDIO + BUDZIKI (ES8311 + MP3 przez I2S)
// ============================================================================
static void audioInfo(Audio::msg_t m) {
  Serial.printf("Audio %s: %s\n", m.s ? m.s : "", m.msg ? m.msg : "");
}

static bool audioPinsReady = false;

static void ensureAudioPins() {
  if (audioPinsReady) return;
  Audio::audio_info_callback = audioInfo;
  audio.setPinout(I2S_BCLK_PIN, I2S_WS_PIN, I2S_DOUT_PIN, I2S_MCLK_PIN);
  audio.setOutput48KHz(true);
  audio.setVolume(DEFAULT_AUDIO_VOLUME);
  audioPinsReady = true;
}

static bool ensureCodec() {
  if (audioReady) return true;
  pinMode(PA_ENABLE_PIN, OUTPUT);
  digitalWrite(PA_ENABLE_PIN, LOW);   // PA wlacza dopiero startSound() PO konfiguracji kodeka (bez trzasku)
  ensureAudioPins();
  audioReady = codec.begin(I2C_SDA_PIN, I2C_SCL_PIN, 400000);
  if (audioReady) { codec.setVolume(CODEC_VOLUME_PERCENT); codec.configBits16(); }
  else { Serial.println("ES8311 init failed"); digitalWrite(PA_ENABLE_PIN, LOW); }
  return audioReady;
}

// Uspij kodek po odtwarzaniu — ES8311 jest na stalej szynie 3V3 (snu CPU go nie
// wylacza), wiec to najwiekszy odbiornik w spoczynku. startSound() go wskrzesza.
static void shutdownCodec() {
  if (!audioReady) { digitalWrite(PA_ENABLE_PIN, LOW); return; }
  audio.stopSong();
  codec.powerDown();
  digitalWrite(PA_ENABLE_PIN, LOW);
  audioReady = false;
}

static bool startSound(uint8_t soundIndex, uint8_t volume) {
  stopPlayback(false);
  if (soundIndex >= SOUND_COUNT) soundIndex = 0;
  if (!ensureFsMounted() || !ensureCodec()) { statusText = "blad FS/kodek"; displayDirty = true; return false; }
  const char *path = SOUND_FILES[soundIndex];
  if (!dataFS->exists(path)) { shutdownCodec(); statusText = String("brak ") + path; displayDirty = true; return false; }

  digitalWrite(PA_ENABLE_PIN, HIGH);
  audio.stopSong();
  audio.setVolume(constrain(volume, 0, MAX_AUDIO_VOLUME));
  codec.setVolume(CODEC_VOLUME_PERCENT);
  if (!audio.connecttoFS(*dataFS, path)) { shutdownCodec(); statusText = String("blad odtw. ") + path; displayDirty = true; return false; }

  soundStartedMs = millis();
  playing = true;
  Serial.printf("Odtwarzam %s vol=%u\n", path, volume);
  displayDirty = true;
  return true;
}

static void stopPlayback(bool userStopped) {
  if (userStopped) { ringing = false; ringingAlarm = -1; ringErrors = 0; }
  if (audioReady) {
    audio.stopSong();
    audio.setVolume(0);
    codec.setVolume(0);
    digitalWrite(PA_ENABLE_PIN, LOW);
  }
  if (playing) { statusText = userStopped ? "STOP" : "koniec"; playing = false; displayDirty = true; }
}

static void startRinging(int alarmIndex) {
  ringing = true;
  ringingAlarm = alarmIndex;
  ringStartMs = millis();
  ringLastRetryMs = millis();
  ringErrors = 0;
  statusText = String("BUDZI: ") + alarms[alarmIndex].label;
  displayDirty = true;
  if (!startSound(alarms[alarmIndex].sound, alarms[alarmIndex].volume)) {
    ringErrors = 1;
    ringLastRetryMs = millis() - RING_RETRY_MS;
  }
}

static void serviceAudio() {
  if (!playing) return;
  if (!audioReady) {
    playing = false;
    digitalWrite(PA_ENABLE_PIN, LOW);
    if (!ringing) statusText = "audio stop";
    displayDirty = true;
    return;
  }
  audio.loop();
  if (!audio.isRunning()) {
    if (ringing) {
      // connecttoFS() zwraca true dla KAZDEGO istniejacego pliku; uszkodzony MP3
      // "konczy sie" po kilkudziesieciu ms. Bez zliczania budzik krecil sie cicho.
      playing = false;
      if (millis() - soundStartedMs < RING_MIN_PLAY_MS) {
        if (++ringErrors >= RING_MAX_ERRORS) { statusText = "budzik: blad MP3"; ringing = false; ringingAlarm = -1; }
      } else ringErrors = 0;
      displayDirty = true;
      return;
    }
    stopPlayback(false);
  }
}

static void serviceRinging() {
  if (!ringing) return;
  if (millis() - ringStartMs > RING_TIMEOUT_MS) {
    statusText = "budzik: timeout"; stopPlayback(false); ringing = false; ringingAlarm = -1; displayDirty = true; return;
  }
  if (playing) return;
  if (millis() - ringLastRetryMs < RING_RETRY_MS) return;
  ringLastRetryMs = millis();
  if (ringingAlarm >= 0 && startSound(alarms[ringingAlarm].sound, alarms[ringingAlarm].volume)) return;
  if (++ringErrors >= RING_MAX_ERRORS) { statusText = "budzik: blad MP3"; ringing = false; ringingAlarm = -1; displayDirty = true; }
}

// ============================================================================
//  [7] BATERIA — ADC, krzywa OCV->SoC, estymator, ochrona
// ============================================================================
static bool initBattery() {
  if (batteryReady) return true;
  adc_oneshot_unit_init_cfg_t initCfg = {};
  initCfg.unit_id = ADC_UNIT_1;
  if (adc_oneshot_new_unit(&initCfg, &batteryAdc) != ESP_OK) return false;

