Rubikrubi/zegar-WAVESHARE-ESP32-S3-4-2-cala-RLCD/zegar-WAVESHARE-ESP32-S3-4-2-cala-RLCD v6.0.ino
  adc_oneshot_chan_cfg_t chanCfg = {};
  chanCfg.bitwidth = ADC_BITWIDTH_12;
  chanCfg.atten = ADC_ATTEN_DB_12;
  if (adc_oneshot_config_channel(batteryAdc, BATTERY_ADC_CHANNEL, &chanCfg) != ESP_OK) {
    adc_oneshot_del_unit(batteryAdc); batteryAdc = nullptr; return false;
  }
  adc_cali_curve_fitting_config_t caliCfg = {};
  caliCfg.unit_id = ADC_UNIT_1;
  caliCfg.atten = ADC_ATTEN_DB_12;
  caliCfg.bitwidth = ADC_BITWIDTH_12;
  batteryCaliReady = adc_cali_create_scheme_curve_fitting(&caliCfg, &batteryCali) == ESP_OK;
  batteryReady = true;
  return true;
}

// Krzywa OCV->SoC dla INR18650-35E (Li-ion NMC), 3.00 V=0%, 4.20 V=100%.
// Rozladowanie NIELINIOWE: plaski srodek 3.70-3.91 V to ~43-71% SoC; konce strome.
// Interpolacja liniowa miedzy punktami. Koszt: kilka porownan co 10 min -> zero
// dodatkowego pradu (brak licznika kulombow / rezystora pomiarowego).
static uint8_t percentFromVoltage(float v) {
  static const struct { float v; uint8_t soc; } OCV[] = {
    { 3.00f,   0 }, { 3.10f,   2 }, { 3.20f,   4 }, { 3.30f,   7 },
    { 3.40f,  11 }, { 3.45f,  14 }, { 3.50f,  18 }, { 3.55f,  23 },
    { 3.60f,  29 }, { 3.65f,  36 }, { 3.70f,  43 }, { 3.73f,  47 },
    { 3.76f,  51 }, { 3.79f,  55 }, { 3.82f,  59 }, { 3.85f,  63 },
    { 3.88f,  68 }, { 3.91f,  71 }, { 3.95f,  76 }, { 4.00f,  80 },
    { 4.05f,  87 }, { 4.10f,  93 }, { 4.15f,  97 }, { 4.20f, 100 },
  };
  const uint8_t N = sizeof(OCV) / sizeof(OCV[0]);
  if (v <= OCV[0].v)   return 0;
  if (v >= OCV[N-1].v) return 100;
  for (uint8_t i = 1; i < N; i++) {
    if (v < OCV[i].v) {
      float frac = (v - OCV[i-1].v) / (OCV[i].v - OCV[i-1].v);
      return (uint8_t)(OCV[i-1].soc + frac * (OCV[i].soc - OCV[i-1].soc) + 0.5f);
    }
  }
  return 100;
}

static uint8_t stabilizePercent(uint8_t measured) {
  if (measured >= BATTERY_FULL_FLOOR) return 100;
  if (batteryHasReading && batteryPercent == 100 && measured >= BATTERY_FULL_HOLD_FLOOR) return 100;
  return measured;
}

// Zwiezle podsumowanie zuzycia do NVS max raz/dobe (nadpisywane, malo flash).
static void maybeWriteDailySummary(time_t now) {
  struct tm t; localtime_r(&now, &t);
  int day = localDayKey(t);
  if (day == g_lastSummaryDay) return;
  float perDay = drainMahPerDay(g_drain);
  if (perDay < 0.0f) return;
  g_lastSummaryDay = day;                      // oznacz dzien NIM sprobujesz zapisu (martwy NVS nie ma byc ponawiany co petle)
  if (!prefs.begin(NVS_NS, false)) return;
  prefs.putUShort("drnSoc", batteryPercent);
  prefs.putFloat("drnMahDay", perDay);
  prefs.putUInt("drnDay", (uint32_t)day);
  prefs.end();
  Serial.printf("Zuzycie: %.1f mAh/dzien, ~%.0f dni\n", perDay, drainDaysRemaining(g_drain, batteryPercent));
}

static void updateBattery(bool force) {
  if (!force && (int32_t)(millis() - batteryNextReadMs) < 0) return;

  // Pod obciazeniem (audio, dzwoniacy budzik, serwer web) napiecie zacisku siada
  // przez rezystancje wewnetrzna ogniwa -> pomiar zanizony. Odlozyc do bezczynnosci.
  if (!force && (playing || ringing || webActive)) { batteryNextReadMs = millis() + BATTERY_BUSY_RETRY_MS; return; }

  batteryNextReadMs = millis() + BATTERY_READ_INTERVAL_MS;
  if (!initBattery()) { batteryNextReadMs = millis() + BATTERY_BUSY_RETRY_MS; return; }

  uint32_t sum = 0; uint8_t samples = 0;
  for (uint8_t i = 0; i < BATTERY_SAMPLE_COUNT; i++) {
    int raw = 0;
    if (adc_oneshot_read(batteryAdc, BATTERY_ADC_CHANNEL, &raw) == ESP_OK) { sum += (uint32_t)raw; samples++; }
  }
  if (samples == 0) { batteryNextReadMs = millis() + BATTERY_BUSY_RETRY_MS; return; }

  int raw = (int)((sum + samples / 2) / samples);
  int mv = 0;
  if (batteryCaliReady) adc_cali_raw_to_voltage(batteryCali, raw, &mv);
  else mv = (raw * 3300) / 4095;

  float measured = (mv * 0.001f) * BATTERY_DIVIDER_RATIO * BATTERY_VOLTAGE_CALIBRATION;
  if (!batteryHasReading || force) { batteryVoltage = measured; batteryHasReading = true; }
  else batteryVoltage = batteryVoltage * 0.80f + measured * 0.20f;   // EMA

  uint8_t old = batteryPercent;
  batteryPercent = stabilizePercent(percentFromVoltage(batteryVoltage));
  time_t nowT = time(nullptr);
  if (isSupportedEpoch(nowT)) {
    drainOnSample(g_drain, (int64_t)nowT, batteryPercent);
    maybeWriteDailySummary(nowT);
#if ENABLE_DIAGNOSTICS
    if (g_coldBootEpoch == 0) g_coldBootEpoch = (int64_t)nowT;
#endif
  }
  if (force || old != batteryPercent) displayDirty = true;
}

#if ENABLE_LOW_BATTERY_PROTECT
static bool batteryLow() { return batteryHasReading && batteryPercent <= BATTERY_LOW_PERCENT; }
// updateBattery() bramkuje pomiar pod obciazeniem, wiec batteryVoltage ~ OCV.
static bool batteryCritical() {
  return batteryHasReading &&
         (batteryVoltage <= BATTERY_CRITICAL_VOLTAGE || batteryPercent <= BATTERY_CRITICAL_PERCENT);
}
#endif

// ============================================================================
//  [8] RYSOWANIE (U8g2) — strony i ikony
// ============================================================================
static void drawPhotoGlyph(int x, int y, int glyph, bool colon) {
  uint16_t p = colon ? PHOTO_COLON_OFFSET : pgm_read_word(&PHOTO_DIGIT_OFFSET[glyph]);
  for (int row = 0; row < PHOTO_DIGIT_H; row++) {
    uint8_t segs = pgm_read_byte(&PHOTO_FONT_RLE[p++]);
    for (uint8_t i = 0; i < segs; i++) {
      uint8_t start = pgm_read_byte(&PHOTO_FONT_RLE[p++]);
      uint8_t width = pgm_read_byte(&PHOTO_FONT_RLE[p++]);
      gfx->drawHLine(x + start, y + row, width);
    }
  }
  // Font (Impact, generowany) ma skrocona dolna stopke cyfry 4 — uzupelniamy ja
  // tu. UWAGA: te 2 prostokaty sa zwiazane z PHOTO_DIGIT_W/H; zmiana fontu wymaga
  // ich rewizji. Regeneracja kompletnego glifu 4 (eliminacja tej latki) wymaga
  // narzedzia generujacego photo_font.h, ktorego tu nie ma -> latka zostaje,
  // zamknieta w jednym miejscu i opisana.
  if (!colon && glyph == 4) {
    gfx->drawBox(x + 39, y + 112, 41, 13);
    gfx->drawBox(x + 40, y + 125, 31, 25);
  }
}

static void drawLargeTime(uint8_t hour, uint8_t minute, int y) {
  int totalW = PHOTO_DIGIT_W * 4 + PHOTO_COLON_W + PHOTO_DIGIT_GAP * 4;
  int x = (LCD_WIDTH - totalW) / 2 + PHOTO_TIME_X_SHIFT;
  drawPhotoGlyph(x, y, hour / 10, false);   x += PHOTO_DIGIT_W + PHOTO_DIGIT_GAP;
  drawPhotoGlyph(x, y, hour % 10, false);   x += PHOTO_DIGIT_W + PHOTO_DIGIT_GAP;
  drawPhotoGlyph(x + PHOTO_COLON_X_SHIFT, y + PHOTO_COLON_Y_SHIFT, 0, true);
  x += PHOTO_COLON_W + PHOTO_DIGIT_GAP;
  drawPhotoGlyph(x, y, minute / 10, false); x += PHOTO_DIGIT_W + PHOTO_DIGIT_GAP;
  drawPhotoGlyph(x, y, minute % 10, false);
}

static void drawBellIcon(int x, int y, bool active) {
  gfx->setDrawColor(1);
  gfx->drawDisc(x + 12, y + 10, 8);
  gfx->drawBox(x + 5, y + 10, 15, 11);
  gfx->drawBox(x + 3, y + 20, 19, 4);
  gfx->drawDisc(x + 12, y + 25, 3);
  gfx->drawBox(x + 9, y + 3, 7, 4);
  if (!active) {
    gfx->drawLine(x + 1, y + 26, x + 25, y + 2);
    gfx->drawLine(x + 2, y + 26, x + 26, y + 2);
  }
}

