Rubikrubi/zegar-WAVESHARE-ESP32-S3-4-2-cala-RLCD/zegar-WAVESHARE-ESP32-S3-4-2-cala-RLCD v6.0.ino
static void drawBatteryIcon(int x, int y, uint8_t percent) {
  if (percent > 100) percent = 100;
  gfx->drawFrame(x, y, 28, 13);
  gfx->drawBox(x + 28, y + 4, 3, 5);
  int fill = map(percent, 0, 100, 0, 24);
  if (fill > 0) gfx->drawBox(x + 2, y + 2, fill, 9);
  char txt[8];
  snprintf(txt, sizeof(txt), "%u%%", percent);
  gfx->setFont(u8g2_font_7x14_tf);
  gfx->drawStr(x - 42, y + 12, txt);
}

static void drawCentered(const char *text, int y) {
  int w = gfx->getStrWidth(text);
  int x = (LCD_WIDTH - w) / 2;
  if (x < 0) x = 0;
  gfx->drawStr(x, y, text);
}

static bool anyAlarmEnabled() {
  for (int i = 0; i < ALARM_COUNT; i++) if (alarms[i].enabled) return true;
  return false;
}

// Najblizszy wlaczony budzik (dzis/jutro). Ranking po realnym epoch (mktime), nie
// po sekundach doby — inaczej w noc zmiany czasu kolejnosc klamie.
static int nextAlarmIndex(uint8_t *h, uint8_t *mi, uint8_t *s, char *label, size_t labelSize) {
  struct tm t;
  bool hasTime = getLocalTm(&t);
  time_t now = hasTime ? time(nullptr) : 0;
  long bestDelta = LONG_MAX;
  int best = -1;
  for (int i = 0; i < ALARM_COUNT; i++) {
    if (!alarms[i].enabled) continue;
    long delta;
    if (hasTime) {
      time_t cand = epochForClock(t, alarms[i].hour, alarms[i].minute, alarms[i].second, 0);
      if (cand <= now) cand = epochForClock(t, alarms[i].hour, alarms[i].minute, alarms[i].second, 1);
      delta = (long)(cand - now);
    } else delta = i;
    if (delta < bestDelta) {
      bestDelta = delta; best = i;
      if (h) *h = alarms[i].hour;
      if (mi) *mi = alarms[i].minute;
      if (s) *s = alarms[i].second;
      if (label && labelSize) { strncpy(label, alarms[i].label, labelSize - 1); label[labelSize - 1] = 0; }
    }
  }
  return best;
}

// Sygnatura WIDOCZNEJ tresci strony zegara (HH:MM, %aku, budzik, WWW). Pola
// niepokazywane (ntpStatus/statusText) NIE wchodza -> zero pelnych sendBuffer()
// identycznej klatki na panelu refleksyjnym (zero mrugniec).
static uint32_t clockSig(const struct tm &t, int day) {
  uint8_t nh = 0, nm = 0;
  int next = nextAlarmIndex(&nh, &nm, nullptr, nullptr, 0);
  uint32_t h = 2166136261u;                           // FNV-1a
  auto mix = [&](uint32_t v) { h = (h ^ v) * 16777619u; };
  mix((uint32_t)t.tm_hour);
  mix((uint32_t)t.tm_min);
  mix((uint32_t)day);
  mix((uint32_t)batteryPercent);
  mix(webActive ? 1u : 0u);
  mix(anyAlarmEnabled() ? 1u : 0u);
  mix(next >= 0 ? (uint32_t)(nh * 60 + nm + 1) : 0u);
  return h;
}

static void drawClockPage(const struct tm &t) {
  uint8_t nh = 0, nm = 0;
  int next = nextAlarmIndex(&nh, &nm, nullptr, nullptr, 0);
  bool alarmOn = anyAlarmEnabled();

  gfx->clearBuffer();
  gfx->setDrawColor(1);
  drawBatteryIcon(360, 8, batteryPercent);

  int y = (LCD_HEIGHT - PHOTO_DIGIT_H) / 2 + PHOTO_TIME_Y_SHIFT;
  drawLargeTime(t.tm_hour, t.tm_min, y);

  gfx->drawHLine(0, 264, LCD_WIDTH);
  drawBellIcon(10, 270, alarmOn);
  gfx->setFont(u8g2_font_7x14_tf);
  char bottom[80];
  if (next >= 0)
    snprintf(bottom, sizeof(bottom), "Budzik %02u:%02u %s  Aku %u%%  WWW:%s",
             nh, nm, alarmOn ? "ON" : "OFF", batteryPercent, webActive ? "ON" : "OFF");
  else
    snprintf(bottom, sizeof(bottom), "Budzik --:-- OFF  Aku %u%%  WWW:%s",
             batteryPercent, webActive ? "ON" : "OFF");
  gfx->drawStr(42, 287, bottom);
  gfx->sendBuffer();
}

// --- Licznik czasu od ostatniego NTP (uzywany przez panel WWW /info) ---
static long secsSinceNtp() {
  if (g_lastNtpSyncEpoch <= 0) return -1;
  time_t now = time(nullptr);
  if (!isSupportedEpoch(now)) return -1;
  long d = (long)(now - (time_t)g_lastNtpSyncEpoch);
  return d < 0 ? 0 : d;
}

static void drawPreviewPage() {
  uint8_t nh = 0, nm = 0, ns = 0;
  char label[sizeof(alarms[0].label)] = "";
  int next = nextAlarmIndex(&nh, &nm, &ns, label, sizeof(label));

  gfx->clearBuffer();
  gfx->setDrawColor(1);
  drawBatteryIcon(360, 8, batteryPercent);
  if (next >= 0) {
    drawBellIcon(10, 8, true);
    gfx->setFont(u8g2_font_9x15_tf);
    drawCentered("NAJBLIZSZY BUDZIK", 25);
    drawLargeTime(nh, nm, 60);
    gfx->drawHLine(0, 264, LCD_WIDTH);
    char detail[96];
    snprintf(detail, sizeof(detail), "%s  %02u:%02u:%02u  [%s]",
             label, nh, nm, ns, SOUND_NAMES[alarms[next].sound % SOUND_COUNT]);
    drawCentered(detail, 287);
  } else {
    drawBellIcon(185, 35, false);
    gfx->setFont(u8g2_font_logisoso50_tf);
    drawCentered("--:--", 150);
    gfx->setFont(u8g2_font_9x15_tf);
    drawCentered("Brak aktywnego budzika", 215);
  }
  gfx->sendBuffer();
  lastClockSig = 0xFFFFFFFFu;   // powrot do zegara wymusi repaint
}

static void drawRingingPage() {
  gfx->clearBuffer();
  gfx->setDrawColor(1);
  drawBatteryIcon(360, 8, batteryPercent);
  drawBellIcon(185, 35, true);
  gfx->setFont(u8g2_font_logisoso50_tf);
  drawCentered("BUDZIK", 150);
  gfx->setFont(u8g2_font_9x15_tf);
  drawCentered(statusText.c_str(), 210);
  drawCentered("Przycisk = wycisz", 245);
  gfx->sendBuffer();
  lastClockSig = 0xFFFFFFFFu;
}

static void drawNightPage() {
  gfx->clearBuffer();
  gfx->setDrawColor(1);
  gfx->setFont(u8g2_font_7x14_tf);
  drawCentered("TRYB NOCNY 23:59 - 06:00", 150);
  gfx->sendBuffer();
  displayDirty = false;
  lastClockSig = 0xFFFFFFFFu;
}

#if ENABLE_LOW_BATTERY_PROTECT
static void drawCriticalBatteryPage() {
  gfx->clearBuffer();
  gfx->setDrawColor(1);
  drawBatteryIcon(360, 8, batteryPercent);
  gfx->setFont(u8g2_font_logisoso32_tf);
  drawCentered("ROZLADOWANY", 120);
  gfx->setFont(u8g2_font_9x15_tf);
  drawCentered("Podlacz ladowarke", 165);
  char b[40];
  snprintf(b, sizeof(b), "%u%%  %.2f V", batteryPercent, batteryVoltage);
  drawCentered(b, 200);
  gfx->sendBuffer();
  lastClockSig = 0xFFFFFFFFu;
}
#endif

static void updateDisplay() {
  if (playing || ringing) {                      // stan nadrzedny: dzwoni budzik
    if (displayDirty) { drawRingingPage(); displayDirty = false; }
    return;
  }
  if (previewActive) {                           // stan nadrzedny: podglad budzika
    if ((int32_t)(millis() - previewUntilMs) < 0) {
      if (displayDirty) { drawPreviewPage(); displayDirty = false; }
      return;
    }
    previewActive = false;
    displayDirty = true;
  }

