Rubikrubi/zegar-WAVESHARE-ESP32-S3-4-2-cala-RLCD/zegar-WAVESHARE-ESP32-S3-4-2-cala-RLCD v6.0.ino
  struct tm t;
  if (!getLocalTm(&t)) {                          // brak czasu
    if (displayDirty) {
      gfx->clearBuffer();
      gfx->setDrawColor(1);
      gfx->setFont(u8g2_font_9x15_tf);
      drawCentered("Brak czasu RTC/NTP", 135);
      drawCentered(ntpStatus.c_str(), 170);
      gfx->sendBuffer();
      displayDirty = false;
      lastClockSig = 0xFFFFFFFFu;
    }
    return;
  }

  // Strona zegara — repaint TYLKO gdy zmienia sie WIDOCZNA tresc (clockSig).
  int day = localDayKey(t);
  uint32_t sig = clockSig(t, day);
  if (sig != lastClockSig) {
    drawClockPage(t);
    lastDrawMinute = t.tm_min; lastDrawDay = day; lastClockSig = sig;
  }
  displayDirty = false;
}

// ============================================================================
//  [9] PANEL WWW (konfiguracja, sync, pliki MP3, /info) — WiFi tylko na zadanie
// ============================================================================
static String htmlEscape(const String &v) {
  String out; out.reserve(v.length() + 8);
  for (size_t i = 0; i < v.length(); i++) {
    char c = v[i];
    if (c == '&') out += F("&amp;");
    else if (c == '<') out += F("&lt;");
    else if (c == '>') out += F("&gt;");
    else if (c == '"') out += F("&quot;");
    else if (c == '\'') out += F("&#39;");
    else out += c;
  }
  return out;
}

static bool parseClock(const String &v, uint8_t *h, uint8_t *mi, uint8_t *s) {
  int hh = 0, mm = 0, ss = 0, consumed = 0;
  int n = sscanf(v.c_str(), "%d:%d:%d%n", &hh, &mm, &ss, &consumed);
  if (n == 2) { ss = 0; consumed = 0; if (sscanf(v.c_str(), "%d:%d%n", &hh, &mm, &consumed) != 2) return false; }
  if (n < 2 || hh < 0 || hh > 23 || mm < 0 || mm > 59 || ss < 0 || ss > 59) return false;
  while (consumed < (int)v.length() && isspace((unsigned char)v[consumed])) consumed++;
  if (consumed != (int)v.length()) return false;
  *h = (uint8_t)hh; *mi = (uint8_t)mm; *s = (uint8_t)ss;
  return true;
}

static String currentTimeText() {
  struct tm t;
  if (!getLocalTm(&t)) return "czas nieustawiony";
  char buf[48];
  snprintf(buf, sizeof(buf), "%04d-%02d-%02d %02d:%02d:%02d",
           t.tm_year + 1900, t.tm_mon + 1, t.tm_mday, t.tm_hour, t.tm_min, t.tm_sec);
  return String(buf);
}

static bool isMp3NameChar(char c) {
  return (c >= 'a' && c <= 'z') || (c >= 'A' && c <= 'Z') ||
         (c >= '0' && c <= '9') || c == '_' || c == '-' || c == '.';
}

// keepCase: kasowanie musi uzyc dokladnie nazwy z listy (FS rozroznia wielkosc liter).
static bool normalizeMp3Path(String name, String &path, bool keepCase) {
  name.trim(); name.replace("\\", "/");
  int slash = name.lastIndexOf('/');
  if (slash >= 0) name = name.substring(slash + 1);
  name.trim();
  if (name.length() < 5 || name.length() > 25) return false;   // SPIFFS: pelna sciezka <=31 znakow, upload pisze "/<nazwa>.part"
  String lower = name; lower.toLowerCase();
  if (!lower.endsWith(".mp3")) return false;
  if (!keepCase) name = lower;
  for (size_t i = 0; i < name.length(); i++) if (!isMp3NameChar(name[i])) return false;
  path = String("/") + name;
  return true;
}

static String formatFileSize(size_t bytes) {
  if (bytes < 1024) return String((uint32_t)bytes) + " B";
  if (bytes < 1024UL * 1024UL) return String(bytes / 1024.0f, 1) + " KB";
  return String(bytes / (1024.0f * 1024.0f), 2) + " MB";
}

static void appendMp3Manager(String &html) {
  html += F("<section><b>Pliki MP3</b>");
  if (!ensureFsMounted()) { html += F("<p>Brak zamontowanego systemu plikow.</p></section>"); return; }
  html += F("<p class='muted'>System plikow: "); html += htmlEscape(dataFSName);
  html += F("</p><form method='post' action='/mp3upload' enctype='multipart/form-data'>"
            "<div class='row'><input type='file' name='mp3' accept='.mp3,audio/mpeg' required>"
            "<button type='submit'>Dodaj / nadpisz MP3</button></div></form>");
  html += F("<table><tr><th>Plik</th><th>Rozmiar</th><th></th></tr>");
  bool any = false;
  File root = dataFS->open("/");
  if (root) {
    for (File file = root.openNextFile(); file; file = root.openNextFile()) {
      if (!file.isDirectory()) {
        String path = file.name();
        if (!path.startsWith("/")) path = String("/") + path;
        String lower = path; lower.toLowerCase();
        if (lower.endsWith(".mp3")) {
          any = true;
          html += F("<tr><td>"); html += htmlEscape(path);
          html += F("</td><td>"); html += formatFileSize(file.size());
          html += F("</td><td><form method='post' action='/mp3delete' style='display:inline'>"
                    "<input type='hidden' name='file' value='"); html += htmlEscape(path);
          html += F("'><button type='submit'>Usun</button></form></td></tr>");
        }
      }
      file.close();
    }
    root.close();
  }
  if (!any) html += F("<tr><td colspan='3'>Brak plikow MP3</td></tr>");
  html += F("</table><p class='muted'>Nazwy: litery/cyfry oraz _ - ., maks. 25 znakow; budziki uzywaja /alarm1.mp3, /alarm2.mp3, /alarm3.mp3.</p></section>");
}

static void pageHeader(String &h) {
  h += F("<!doctype html><html><head><meta charset='utf-8'>"
         "<meta name='viewport' content='width=device-width,initial-scale=1'>"
         "<title>Zegar NTP</title><style>"
         "body{font-family:system-ui,Arial;margin:16px;background:#f5f5f5;color:#111}"
         "main{max-width:760px;margin:auto}section{background:#fff;border:1px solid #ddd;padding:12px;margin:12px 0}"
         "input,button,select{font:inherit;padding:6px;margin:3px}label{display:inline-block;margin:4px 8px 4px 0}"
         "table{width:100%;border-collapse:collapse}td,th{border-bottom:1px solid #ddd;padding:6px;text-align:left}"
         ".row{display:flex;gap:8px;flex-wrap:wrap;align-items:center}.muted{color:#666}"
         "</style></head><body><main><h1>Zegar NTP — 3 budziki</h1>"
         "<p class='muted'>" FW_NAME " v" FW_VERSION " &middot; build " FW_BUILD_DATE " " FW_BUILD_TIME "</p>");
}

static void handleRoot() {
  webUntilMs = millis() + WEB_WINDOW_MS;
  updateBattery(false);   // bez wymuszania: pod WiFi pomiar zanizony, OCV po zamknieciu WWW
  String html; html.reserve(14000);
  pageHeader(html);

  html += F("<section><b>Status</b><p>Czas: "); html += currentTimeText();
  html += F("<br>Budzik: ");     html += htmlEscape(statusText);
  html += F("<br>NTP: ");        html += htmlEscape(ntpStatus);
  html += F("<br>Pliki MP3: ");  html += htmlEscape(dataFSName);
  html += F("<br>Akumulator: "); html += batteryPercent;
  html += F("% (");              html += String(batteryVoltage, 2);
  html += F(" V, ok. ");         html += String((uint32_t)batteryPercent * BATTERY_CAPACITY_MAH / 100U);
  html += F(" mAh)<br>IP: ");    html += WiFi.localIP().toString();
  {
    float perDay = drainMahPerDay(g_drain);
    float daysLeft = drainDaysRemaining(g_drain, batteryPercent);
    html += F("<br>Zuzycie: ");
    if (perDay < 0)       html += F("zbieram dane (min ~12 h)");
    else if (perDay == 0) html += F("brak mierzalnego zuzycia");
    else { html += String(perDay, 1); html += F(" mAh/dzien, ~"); html += String(daysLeft, 0); html += F(" dni do rozladowania"); }
  }
  html += F("</p><p><a href='/sync'><button>Synchronizuj NTP</button></a>"
            "<a href='/stop'><button>Stop MP3</button></a>");
#if ENABLE_DIAGNOSTICS
  html += F("<a href='/info'><button>Informacje</button></a>");
#endif
  html += F("<a href='/off'><button>Wylacz panel WWW</button></a>");
  html += F("</p></section>");

  html += F("<form method='post' action='/save'>");
  // Hasla nie renderujemy (panel bez logowania; kazdy w LAN odczytalby je ze zrodla).
  html += F("<section><b>WiFi</b><div class='row'><label>SSID <input name='ssid' value='");
  html += htmlEscape(wifiSsid);
  html += F("'></label><label>Haslo <input name='pass' type='password' placeholder='(bez zmian)'>"
            "</label></div><p class='muted'>Puste pole hasla = haslo bez zmian.</p></section>");

