Rubikrubi/zegar-WAVESHARE-ESP32-S3-4-2-cala-RLCD/zegar-WAVESHARE-ESP32-S3-4-2-cala-RLCD v6.0.ino
  html += F("<section><b>Budziki</b><table>"
            "<tr><th>Wl.</th><th>Czas</th><th>Glos.</th><th>Dzwiek</th><th>Nazwa</th></tr>");
  for (int i = 0; i < ALARM_COUNT; i++) {
    char timeBuf[16];
    snprintf(timeBuf, sizeof(timeBuf), "%02u:%02u:%02u", alarms[i].hour, alarms[i].minute, alarms[i].second);
    html += F("<tr><td><input type='checkbox' name='en"); html += i; html += F("' ");
    if (alarms[i].enabled) html += F("checked");
    html += F("></td><td><input type='time' step='1' name='time"); html += i;
    html += F("' value='"); html += timeBuf;
    html += F("'></td><td><input type='number' min='0' max='21' name='vol"); html += i;
    html += F("' value='"); html += alarms[i].volume;
    html += F("'></td><td><select name='snd"); html += i; html += F("'>");
    for (int sIdx = 0; sIdx < SOUND_COUNT; sIdx++) {
      html += F("<option value='"); html += sIdx; html += F("'");
      if (alarms[i].sound == sIdx) html += F(" selected");
      html += F(">"); html += SOUND_NAMES[sIdx]; html += F("</option>");
    }
    html += F("</select></td><td><input maxlength='15' name='label"); html += i;
    html += F("' value='"); html += htmlEscape(alarms[i].label);
    html += F("'></td></tr>");
  }
  html += F("</table><p class='muted'>Dzwiek 1/2/3 = /alarm1.mp3 /alarm2.mp3 /alarm3.mp3.</p></section>");
  html += F("<p><button type='submit'>Zapisz</button></p></form>");

  appendMp3Manager(html);

  html += F("<section><b>Test dzwiekow</b><div class='row'>");
  for (int sIdx = 0; sIdx < SOUND_COUNT; sIdx++) {
    html += F("<form method='post' action='/test' style='display:inline'>"
              "<input type='hidden' name='snd' value='"); html += sIdx;
    html += F("'><button type='submit'>Test "); html += SOUND_NAMES[sIdx]; html += F("</button></form>");
  }
  html += F("</div></section></main></body></html>");
  server.send(200, "text/html", html);
}

static void handleSave() {
  webUntilMs = millis() + WEB_WINDOW_MS;
  if (server.hasArg("ssid")) { String ssid = server.arg("ssid"); ssid.trim(); ssid.toCharArray(wifiSsid, sizeof(wifiSsid)); }
  if (server.hasArg("pass") && server.arg("pass").length() > 0) { String pass = server.arg("pass"); pass.toCharArray(wifiPass, sizeof(wifiPass)); }

  for (int i = 0; i < ALARM_COUNT; i++) {
    String idx = String(i);
    uint8_t prevEnabled = alarms[i].enabled;
    uint8_t prevH = alarms[i].hour, prevM = alarms[i].minute, prevS = alarms[i].second;
    alarms[i].enabled = server.hasArg(String("en") + idx) ? 1 : 0;
    uint8_t h, m, s;
    if (parseClock(server.arg(String("time") + idx), &h, &m, &s)) { alarms[i].hour = h; alarms[i].minute = m; alarms[i].second = s; }
    bool timeChanged = (alarms[i].hour != prevH || alarms[i].minute != prevM || alarms[i].second != prevS);
    bool reEnabled   = (alarms[i].enabled && !prevEnabled);
    if (timeChanged || reEnabled) lastTriggerDay[i] = -1;   // ponowne uzbrojenie: moze odpalic dzis ponownie
    String volumeArg = String("vol") + idx, soundArg = String("snd") + idx, labelArg = String("label") + idx;
    if (server.hasArg(volumeArg)) alarms[i].volume = constrain(server.arg(volumeArg).toInt(), 0, MAX_AUDIO_VOLUME);
    if (server.hasArg(soundArg))  alarms[i].sound  = constrain(server.arg(soundArg).toInt(), 0, SOUND_COUNT - 1);
    if (server.hasArg(labelArg)) {
      String label = server.arg(labelArg); label.trim();
      if (label.length() == 0) label = "Budzik " + String(i + 1);
      label.toCharArray(alarms[i].label, sizeof(alarms[i].label));
    }
    sanitizeAlarm(alarms[i], i);
  }
  saveSettings();
  displayDirty = true;
  server.sendHeader("Location", "/");
  server.send(303, "text/plain", "");
}

static void handleSync() { syncNtp(true); server.sendHeader("Location", "/"); server.send(303, "text/plain", ""); }
static void handleStop() { stopPlayback(true); server.sendHeader("Location", "/"); server.send(303, "text/plain", ""); }

static void handleTest() {
  // Nie przerywaj dzwoniacego budzika testem (startSound nie kasuje ringing).
  if (!ringing) { uint8_t sIdx = constrain(server.arg("snd").toInt(), 0, SOUND_COUNT - 1); startSound(sIdx, DEFAULT_AUDIO_VOLUME); }
  server.sendHeader("Location", "/");
  server.send(303, "text/plain", "");
}

static void handleMp3UploadDone() { server.sendHeader("Location", "/"); server.send(303, "text/plain", ""); }

static void handleMp3UploadStream() {
  webUntilMs = millis() + WEB_WINDOW_MS;
  watchdogFeed();   // callback per fragment: upload duzego MP3 blokuje loop() minutami
  HTTPUpload &upload = server.upload();
  if (upload.status == UPLOAD_FILE_START) {
    if (mp3UploadFile) mp3UploadFile.close();
    mp3UploadAccepted = false; mp3UploadHadData = false; mp3UploadPath = ""; mp3UploadTempPath = "";
    if (!normalizeMp3Path(upload.filename, mp3UploadPath, false)) { statusText = "zla nazwa MP3"; displayDirty = true; return; }
    if (!ensureFsMounted()) { statusText = "brak FS dla MP3"; displayDirty = true; return; }
    if (playing || ringing) stopPlayback(true);
    mp3UploadTempPath = mp3UploadPath + ".part";
    if (dataFS->exists(mp3UploadTempPath)) dataFS->remove(mp3UploadTempPath);
    mp3UploadFile = dataFS->open(mp3UploadTempPath, FILE_WRITE);
    mp3UploadAccepted = (bool)mp3UploadFile;
    statusText = mp3UploadAccepted ? String("upload ") + mp3UploadPath : "blad zapisu MP3";
    displayDirty = true;
  } else if (upload.status == UPLOAD_FILE_WRITE) {
    if (mp3UploadAccepted && mp3UploadFile) {
      size_t written = mp3UploadFile.write(upload.buf, upload.currentSize);
      if (written != upload.currentSize) { mp3UploadAccepted = false; statusText = "blad zapisu MP3"; }
      else if (upload.currentSize > 0) mp3UploadHadData = true;
    }
  } else if (upload.status == UPLOAD_FILE_END) {
    if (mp3UploadFile) mp3UploadFile.close();
    if (mp3UploadAccepted && mp3UploadHadData) {
      String backupPath = mp3UploadPath + ".bak";
      if (dataFS->exists(backupPath)) dataFS->remove(backupPath);
      bool hadOld = dataFS->exists(mp3UploadPath);
      bool oldMoved = !hadOld || dataFS->rename(mp3UploadPath, backupPath);
      bool newInstalled = oldMoved && dataFS->rename(mp3UploadTempPath, mp3UploadPath);
      if (newInstalled) {
        if (dataFS->exists(backupPath)) dataFS->remove(backupPath);
        statusText = String("dodano ") + mp3UploadPath;
      } else {
        if (oldMoved && hadOld) {
          if (dataFS->exists(mp3UploadPath)) dataFS->remove(mp3UploadPath);
          if (dataFS->exists(backupPath)) dataFS->rename(backupPath, mp3UploadPath);
        }
        if (dataFS->exists(mp3UploadTempPath)) dataFS->remove(mp3UploadTempPath);
        statusText = "blad instalacji MP3";
      }
    } else {
      if (mp3UploadTempPath.length() && dataFS && dataFS->exists(mp3UploadTempPath)) dataFS->remove(mp3UploadTempPath);
      if (statusText == String("upload ") + mp3UploadPath) statusText = "pusty MP3";
    }
    displayDirty = true;
  } else if (upload.status == UPLOAD_FILE_ABORTED) {
    if (mp3UploadFile) mp3UploadFile.close();
    if (mp3UploadTempPath.length() && dataFS && dataFS->exists(mp3UploadTempPath)) dataFS->remove(mp3UploadTempPath);
    statusText = "upload przerwany";
    displayDirty = true;
  }
}

