Rubikrubi/zegar-WAVESHARE-ESP32-S3-4-2-cala-RLCD/zegar-WAVESHARE-ESP32-S3-4-2-cala-RLCD v6.0.ino
static void handleMp3Delete() {
  String path;
  if (!normalizeMp3Path(server.arg("file"), path, true)) statusText = "zla nazwa MP3";
  else if (!ensureFsMounted()) statusText = "brak FS dla MP3";
  else {
    if (playing || ringing) stopPlayback(true);
    statusText = (dataFS->exists(path) && dataFS->remove(path)) ? String("usunieto ") + path : String("brak ") + path;
  }
  displayDirty = true;
  server.sendHeader("Location", "/");
  server.send(303, "text/plain", "");
}

#if ENABLE_DIAGNOSTICS
static void handleInfo() {
  webUntilMs = millis() + WEB_WINDOW_MS;
  updateBattery(false);
  String html; html.reserve(4500);
  pageHeader(html);
  html += F("<section><b>Informacje / diagnostyka</b><table>");
  auto row = [&](const char *k, const String &v) {
    html += F("<tr><td>"); html += k; html += F("</td><td>"); html += htmlEscape(v); html += F("</td></tr>");
  };
  row("Nazwa", FW_NAME);
  row("Wersja", String("v" FW_VERSION));
  row("Kompilacja", String(FW_BUILD_DATE) + " " + FW_BUILD_TIME);
  row("Czas lokalny", currentTimeText());
  {
    long s = secsSinceNtp();
    row("Od ostatniego NTP", s < 0 ? String("brak synchronizacji")
        : String(s / 3600) + " h " + String((s % 3600) / 60) + " min");
  }
  row("Przyczyna ostatniego resetu", resetReasonText(esp_reset_reason()));
  row("Rozruchy od zimnego startu", String(g_bootCount));
  {
    time_t now = time(nullptr);
    if (isSupportedEpoch(now) && g_coldBootEpoch > 0) {
      long s = (long)(now - (time_t)g_coldBootEpoch); if (s < 0) s = 0;
      char buf[48];
      snprintf(buf, sizeof(buf), "%ld dni %02ld:%02ld:%02ld", s / 86400, (s % 86400) / 3600, (s % 3600) / 60, s % 60);
      row("Czas pracy (od zimnego startu)", buf);
    } else row("Czas pracy (od zimnego startu)", "ustala sie");
  }
  row("Resety brownout / WDT / panic",
      String(g_brownoutResets) + " / " + String(g_wdtResets) + " / " + String(g_panicResets));
  row("Heap wolny", String(ESP.getFreeHeap()) + " B");
  row("Heap min. od startu", String(ESP.getMinFreeHeap()) + " B");
  row("Heap najwiekszy blok", String(ESP.getMaxAllocHeap()) + " B");
  row("RTC offset (0x02)",
      "0x" + String(g_rtcOffsetRaw, HEX) + " (LSB " + String((int)g_rtcOffsetLsb) + ", " + String(g_rtcOffsetPpm, 1) + " ppm)");
  row("RTC offset status",
      g_rtcOffsetVerified ? String("OK (potwierdzony odczytem 0x02)")
        : (g_rtcOffsetRaw == 0xFF ? String("BLAD: brak odczytu rejestru 0x02")
             : String("NIEZWERYFIKOWANY: zapis 0x") + String(RTC_OFFSET_VALUE, HEX) + " != odczyt 0x" + String(g_rtcOffsetRaw, HEX)));
  if (g_lastNtpSyncEpoch > 0 && g_prevNtpSyncEpoch > 0) {
    long  winSec = (long)(g_lastNtpSyncEpoch - g_prevNtpSyncEpoch);
    float winH   = winSec / 3600.0f;
    // Dryft z rejestrow czasu PCF85063A ma rozdzielczosc 1 s -> niepewnosc +-1 s/okno.
    float driftPpm    = winSec > 0 ? (float)g_lastRtcDriftSec / winSec * 1e6f : 0.0f;
    float driftPerDay = driftPpm * PPM_SEC_PER_DAY;
    float uncPpm      = winSec > 0 ? 1.0f / winSec * 1e6f : 0.0f;
    int   suggest     = suggestedTotalOffsetLsb(driftPerDay, g_rtcOffsetLsb);
    row("Dryft RTC (ostatni sync)",
        String(g_lastRtcDriftSec) + " s / " + String(winH, 1) + " h  (" + String(driftPpm, 1) + " +-" +
        String(uncPpm, 1) + " ppm, ~" + String(driftPerDay, 2) + " s/dobe)");
    row("Sugerowany offset RTC",
        "LSB " + String(suggest) + " -> 0x" + String(encodeRtcOffset(suggest, false), HEX) +
        " (z biezacego LSB " + String((int)g_rtcOffsetLsb) + ")");
  } else row("Dryft RTC (ostatni sync)", "brak danych (min. 2 synchronizacje)");
  row("Dryft — rozdzielczosc", "1 s (PCF85063A bez rejestru pod-sekundowego; mierz kilka dob dla < 1 ppm)");
  row("Akumulator", String(batteryPercent) + "% (" + String(batteryVoltage, 2) + " V)");
#if ENABLE_LOW_BATTERY_PROTECT
  row("Ochrona ogniwa", batteryCritical() ? "KRYTYCZNY" : (batteryLow() ? "tryb oszczedny (bez auto-NTP)" : "OK"));
#endif
  if (WiFi.status() == WL_CONNECTED) { row("WiFi", WiFi.SSID() + "  RSSI " + String(WiFi.RSSI()) + " dBm"); row("IP", WiFi.localIP().toString()); }
  else row("WiFi", "rozlaczone");
  row("System plikow", dataFSName);
  html += F("</table><p><a href='/'><button>Powrot</button></a></p></section></main></body></html>");
  server.send(200, "text/html", html);
}
#endif

// Reczne wylaczenie panelu WWW: odsyla potwierdzenie, a samo zamkniecie (server.stop
// + WiFi OFF) wykonuje petla PO wyslaniu odpowiedzi — ustawiamy termin okna na "teraz",
// wiec po handleClient() warunek uplywu okna zamknie panel (jak auto-timeout 5 min).
static void handleWebOff() {
  String html; pageHeader(html);
  html += F("<section><b>Panel WWW wylaczony.</b>"
            "<p class='muted'>WiFi zostalo wylaczone dla oszczednosci baterii. "
            "Aby wlaczyc panel ponownie: przytrzymaj przycisk KEY na zegarze.</p>"
            "</section></main></body></html>");
  server.send(200, "text/html", html);
  webUntilMs = millis();   // petla wykryje uplyw okna i zamknie panel po flushu strony
}

static bool startWebWindow() {
  if (webActive) {
    if (WiFi.status() == WL_CONNECTED) { webUntilMs = millis() + WEB_WINDOW_MS; displayDirty = true; return true; }
    server.stop(); webActive = false;
  }
  if (!ensureWifi(NTP_WIFI_TIMEOUT_MS)) { statusText = "brak polaczenia WiFi"; stopWifiAndNtp(); displayDirty = true; return false; }
  if (!webRoutesInstalled) {
    server.on("/", HTTP_GET, handleRoot);
    server.on("/save", HTTP_POST, handleSave);
    server.on("/sync", HTTP_GET, handleSync);
    server.on("/stop", HTTP_GET, handleStop);
    server.on("/test", HTTP_POST, handleTest);
    server.on("/mp3upload", HTTP_POST, handleMp3UploadDone, handleMp3UploadStream);
    server.on("/mp3delete", HTTP_POST, handleMp3Delete);
    server.on("/off", HTTP_GET, handleWebOff);
#if ENABLE_DIAGNOSTICS
    server.on("/info", HTTP_GET, handleInfo);
#endif
    webRoutesInstalled = true;
  }
  server.begin();
  webActive = true;
  webUntilMs = millis() + WEB_WINDOW_MS;
  displayDirty = true;
  Serial.print("WWW IP: "); Serial.println(WiFi.localIP());
  return true;
}

