Rubikrubi/zegar-WAVESHARE-ESP32-S3-4-2-cala-RLCD/zegar-WAVESHARE-ESP32-S3-4-2-cala-RLCD v6.0.ino
static void stopWebWindow() {
  server.stop();
  webActive = false;
  // Aktywna proba NTP (do ~50 s) sama dokonczy walidacje i wylaczy WiFi.
  if (ntpSyncState == NTP_SYNC_IDLE) stopWifiAndNtp();
  displayDirty = true;
}

// ============================================================================
//  [10] BUDZIKI + HARMONOGRAM NTP (jedna synchronizacja na dobe)
// ============================================================================
static void checkAlarms(uint32_t lateWindowSec) {
  if (playing || ringing) return;
  time_t now = time(nullptr);
  struct tm t;
  if (!isSupportedEpoch(now)) return;
  localtime_r(&now, &t);
  for (int i = 0; i < ALARM_COUNT; i++) {
    if (!alarms[i].enabled) continue;
    int occurrenceDay;
    if (alarmDueNow(t, now, alarms[i].hour, alarms[i].minute, alarms[i].second, lateWindowSec, &occurrenceDay) &&
        lastTriggerDay[i] != occurrenceDay) {
      lastTriggerDay[i] = occurrenceDay;
      // Skonsumuj inne budziki wymagalne w tej samej chwili (kolizja godzin w noc
      // zmiany czasu: 02:30 i 03:30 = ten sam epoch) -> jedno dzwonienie.
      for (int j = 0; j < ALARM_COUNT; j++) {
        int otherDay;
        if (j != i && alarms[j].enabled &&
            alarmDueNow(t, now, alarms[j].hour, alarms[j].minute, alarms[j].second, lateWindowSec, &otherDay))
          lastTriggerDay[j] = otherDay;
      }
      startRinging(i);
      return;
    }
  }
}

static void checkNtpSchedule() {
#if ENABLE_LOW_BATTERY_PROTECT
  // ECO: gdy mamy poprawny czas, NIE budz WiFi do auto-sync (najwiekszy pobor).
  // Pusty RTC -> pozwol sie synchronizowac mimo niskiej baterii (zegar musi miec czas).
  if (batteryLow() && isSupportedEpoch(time(nullptr))) return;
#endif
  if (handleNtpRetry()) return;
  struct tm t;
  if (!getLocalTm(&t)) return;
  int day = localDayKey(t);
  // Preferowane okno 10:00-10:05; pominiete (np. dlugi upload) -> dogon o dowolnej
  // porze az do poczatku nocy. ntpStartedDay gwarantuje DOKLADNIE jeden sync/dobe.
  bool preferredWindow = (t.tm_hour == NTP_HOUR && t.tm_min <= NTP_MIN_WINDOW);
  bool catchupWindow   = (t.tm_hour >= NTP_HOUR && t.tm_hour < NIGHT_START_HOUR);
  if ((preferredWindow || catchupWindow) && ntpStartedDay != day) {
    ntpStartedDay = day;
    ntpRetriesLeft = 2;
    syncNtp(false);
  }
}

// ============================================================================
//  [11] ZARZADZANIE ENERGIA — tryb nocny (deep-sleep), light-sleep, ochronny sen
// ============================================================================
static bool anyAlarmDueNow(const struct tm &t) {
  time_t now = time(nullptr);
  for (int i = 0; i < ALARM_COUNT; i++)
    if (alarms[i].enabled &&
        alarmDueNow(t, now, alarms[i].hour, alarms[i].minute, alarms[i].second, ALARM_LATE_WINDOW_SEC, nullptr))
      return true;
  return false;
}

static time_t nightEndEpoch(time_t now) {
  if (!isSupportedEpoch(now)) return 0;
  struct tm t; localtime_r(&now, &t);
  time_t end = epochForClock(t, NIGHT_END_HOUR, NIGHT_END_MIN, 0, 0);
  if (end <= now) end = epochForClock(t, NIGHT_END_HOUR, NIGHT_END_MIN, 0, 1);
  return end;
}

static time_t nextAlarmEpoch(const struct tm &base, time_t now) {
  time_t best = 0;
  for (int i = 0; i < ALARM_COUNT; i++) {
    if (!alarms[i].enabled) continue;
    time_t cand = epochForClock(base, alarms[i].hour, alarms[i].minute, alarms[i].second, 0);
    if (cand <= now) cand = epochForClock(base, alarms[i].hour, alarms[i].minute, alarms[i].second, 1);
    if (best == 0 || cand < best) best = cand;
  }
  return best;
}

static void releaseNightHolds() {
  gpio_deep_sleep_hold_dis();
  for (auto pin : HOLD_PINS) gpio_hold_dis(pin);
  gpio_hold_dis((gpio_num_t)PA_ENABLE_PIN);
  rtc_gpio_deinit((gpio_num_t)KEY_PIN);
  rtc_gpio_deinit((gpio_num_t)PREVIEW_BUTTON_PIN);
  rtc_gpio_deinit((gpio_num_t)RTC_INT_PIN);
}

static void holdNightPins() {
  pinMode(RLCD_RST_PIN, OUTPUT);  digitalWrite(RLCD_RST_PIN, HIGH);
  pinMode(RLCD_CS_PIN, OUTPUT);   digitalWrite(RLCD_CS_PIN, HIGH);
  pinMode(RLCD_DC_PIN, OUTPUT);   digitalWrite(RLCD_DC_PIN, HIGH);
  pinMode(RLCD_SCK_PIN, OUTPUT);  digitalWrite(RLCD_SCK_PIN, LOW);
  pinMode(RLCD_MOSI_PIN, OUTPUT); digitalWrite(RLCD_MOSI_PIN, LOW);
  pinMode(PA_ENABLE_PIN, OUTPUT); digitalWrite(PA_ENABLE_PIN, LOW);
  for (auto pin : HOLD_PINS) gpio_hold_en(pin);
  gpio_hold_en((gpio_num_t)PA_ENABLE_PIN);
  gpio_deep_sleep_hold_en();
}

static void shutdownNightPeripherals() {
  if (webActive) { server.stop(); webActive = false; }
  stopWifiAndNtp();
  stopPlayback(true);
  shutdownCodec();
  pinMode(PA_ENABLE_PIN, OUTPUT);
  digitalWrite(PA_ENABLE_PIN, LOW);
}

#if ENABLE_LOW_BATTERY_PROTECT
// Ochronny deep-sleep przy krytycznym ogniwie: chroni Li-ion przed glebokim
// rozladowaniem i brownoutem. Budzi sie cyklicznie (timer) sprawdzic ladowanie;
// KEY pozwala wybudzic recznie. Pomijane przy dzwoniacym budziku / audio / WWW /
// podgladzie / aktywnym NTP/zapisie RTC. Deep-sleep resetuje chip -> setup()
// ponownie zmierzy ogniwo i wznowi prace lub usnie dalej.
static void enterCriticalBatterySleepIfNeeded() {
  if (!batteryCritical()) return;
  if (playing || ringing || webActive || previewActive ||
      ntpSyncState != NTP_SYNC_IDLE || rtcWriteRetriesLeft != 0) return;

  Serial.printf("Akumulator krytyczny (%u%%, %.2f V) -> ochronny sen %lu s\n",
                batteryPercent, batteryVoltage, (unsigned long)BATTERY_CRITICAL_RECHECK_SEC);
  drawCriticalBatteryPage();
  delay(150);
  shutdownNightPeripherals();
  setCpuFrequencyMhz(NIGHT_CPU_MHZ);
  watchdogFeed();
  esp_sleep_enable_timer_wakeup((uint64_t)BATTERY_CRITICAL_RECHECK_SEC * 1000000ULL);
  esp_sleep_enable_ext1_wakeup((1ULL << KEY_PIN), ESP_EXT1_WAKEUP_ANY_LOW);
  rtc_gpio_pullup_en((gpio_num_t)KEY_PIN);
  rtc_gpio_pulldown_dis((gpio_num_t)KEY_PIN);
  holdNightPins();
  Serial.flush();
  esp_deep_sleep_start();
}
#endif

// Tryb nocny: deep-sleep do 06:00 / najblizszego budzika. Ekran zgaszony (panel
// refleksyjny w ciemnosci i tak nieczytelny). Budzenie: alarm RTC (dokladny) +
// timer ESP (zabezpieczenie) + przyciski EXT1.
static void enterNightSleepIfNeeded(bool force) {
  struct tm t;
  if (!getLocalTm(&t) || !isNightMode(t)) return;
  if (anyAlarmDueNow(t)) return;
  if (!force && (webActive || playing || ringing || previewActive ||
                 ntpSyncState != NTP_SYNC_IDLE || rtcWriteRetriesLeft != 0 ||
                 (int32_t)(millis() - wakeHoldUntilMs) < 0)) return;   // utrzymaj wybudzenie po nacisnieciu

  time_t now = time(nullptr);
  time_t wakeAt = nightEndEpoch(now);
  time_t alarmAt = nextAlarmEpoch(t, now);
  if (alarmAt > now && alarmAt < wakeAt) wakeAt = alarmAt;
  if (wakeAt <= now) wakeAt = now + 6 * 60 * 60;
  uint64_t sleepSec = (uint64_t)(wakeAt - now);
  if (sleepSec < NIGHT_MIN_SLEEP_SEC) { sleepSec = NIGHT_MIN_SLEEP_SEC; wakeAt = now + (time_t)sleepSec; }

