Rubikrubi/zegar-WAVESHARE-ESP32-S3-4-2-cala-RLCD/zegar-WAVESHARE-ESP32-S3-4-2-cala-RLCD v6.0.ino
  bool rtcAlarmOk = rtcSetWakeAlarm(wakeAt);
  if (rtcAlarmOk && digitalRead(RTC_INT_PIN) != HIGH) { rtcDisableWakeAlarm(); rtcAlarmOk = false; }
  // Bez dzialajacego alarmu RTC budzi tylko timer ESP na niedokladnym RC: spij w
  // odcinkach, by kazde wybudzenie zakotwiczylo czas z PCF85063A (setup) i dryft
  // pojedynczego odcinka byl << okno wylapania budzika.
  if (!rtcAlarmOk) {
    bool alarmIsNextEvent = (alarmAt > now && wakeAt == alarmAt);
    uint64_t cap = alarmIsNextEvent ? NIGHT_FALLBACK_ALARM_CHUNK_SEC : NIGHT_FALLBACK_CHUNK_SEC;
    if (sleepSec > cap) sleepSec = cap;
  }
  Serial.printf("Tryb nocny: sleep %llu s, RTC alarm: %s\n",
                (unsigned long long)sleepSec, rtcAlarmOk ? "OK" : "ERR");
  drawNightPage();
  delay(150);
  shutdownNightPeripherals();
  setCpuFrequencyMhz(NIGHT_CPU_MHZ);
  esp_sleep_enable_timer_wakeup(sleepSec * 1000000ULL);
  uint64_t wakeMask = (1ULL << KEY_PIN) | (1ULL << PREVIEW_BUTTON_PIN);
  if (rtcAlarmOk) wakeMask |= (1ULL << RTC_INT_PIN);
  esp_sleep_enable_ext1_wakeup(wakeMask, ESP_EXT1_WAKEUP_ANY_LOW);
  rtc_gpio_pullup_en((gpio_num_t)KEY_PIN);  rtc_gpio_pulldown_dis((gpio_num_t)KEY_PIN);
  rtc_gpio_pullup_en((gpio_num_t)PREVIEW_BUTTON_PIN); rtc_gpio_pulldown_dis((gpio_num_t)PREVIEW_BUTTON_PIN);
  if (rtcAlarmOk) { rtc_gpio_pullup_en((gpio_num_t)RTC_INT_PIN); rtc_gpio_pulldown_dis((gpio_num_t)RTC_INT_PIN); }
  watchdogFeed();
  holdNightPins();
  Serial.flush();
  esp_deep_sleep_start();
}

// Dynamiczny light-sleep w dzien: spij do granicy nastepnej minuty (ekran HH:MM
// zmienia sie na czas) lub do sekundy najblizszego budzika, max 60 s. RLCD trzyma
// obraz; przyciski wybudzaja przez EXT1. Light-sleep NIE rebootuje -> setup() sie
// nie powtarza -> brak mrugania.
static uint64_t computeIdleSleepUs() {
  time_t now = time(nullptr);
  if (!isSupportedEpoch(now)) return IDLE_LIGHT_SLEEP_US;   // czas nieznany -> krotki sen
  struct tm t; localtime_r(&now, &t);
  uint64_t sleepSec = 60 - (uint64_t)t.tm_sec;             // do granicy minuty
  time_t alarmAt = nextAlarmEpoch(t, now);
  if (alarmAt > now) { uint64_t toAlarm = (uint64_t)(alarmAt - now); if (toAlarm < sleepSec) sleepSec = toAlarm; }
  if (sleepSec > IDLE_LIGHT_SLEEP_MAX_SEC) sleepSec = IDLE_LIGHT_SLEEP_MAX_SEC;
  if (sleepSec < 1) sleepSec = 1;
  return sleepSec * 1000000ULL;
}

static void idlePowerSave() {
  // Nie usypiaj na dlugo, gdy cos wymaga szybkiej obslugi: WWW, audio/dzwonienie,
  // podglad, trwajacy NTP, zaplanowany zapis RTC, lub nacisniety przycisk.
  // wakeHoldUntilMs: po aktywnosci przyciskiem trzymaj wybudzenie, by maszyna stanu
  // KEY zdazyla wykryc ZWOLNIENIE (debounce) i wykonac akcje krotka (wlacz panel WWW
  // / wycisz). Bez tego po szybkim tapnieciu uklad zasypial przed obsluga zwolnienia
  // -> panel WWW wstawal dopiero po ktoryms kolejnym wybudzeniu.
  if (webActive || playing || ringing || previewActive ||
      ntpSyncState != NTP_SYNC_IDLE || rtcWriteRetriesLeft != 0 ||
      (int32_t)(millis() - wakeHoldUntilMs) < 0) { delay(5); return; }
  if (digitalRead(KEY_PIN) == LOW || digitalRead(PREVIEW_BUTTON_PIN) == LOW) { delay(5); return; }

  if (audioReady) shutdownCodec();   // kodek niepotrzebny w spoczynku -> uspij ES8311

  esp_sleep_enable_timer_wakeup(computeIdleSleepUs());
  const uint64_t wakeMask = (1ULL << KEY_PIN) | (1ULL << PREVIEW_BUTTON_PIN);
  esp_err_t extWake = esp_sleep_enable_ext1_wakeup(wakeMask, ESP_EXT1_WAKEUP_ANY_LOW);
#if POWER_DOWN_FLASH_IN_SLEEP
  esp_sleep_pd_config(ESP_PD_DOMAIN_VDDSDIO, ESP_PD_OPTION_OFF);
#endif
  watchdogFeed();
  esp_light_sleep_start();
  watchdogFeed();
  // EXT1 zostawia RTC-hold na padach wybudzajacych — zwolnij od razu, inaczej
  // digitalRead zwraca zatrzasniety stan i przyciski sa martwe do restartu.
  rtc_gpio_hold_dis((gpio_num_t)KEY_PIN);
  rtc_gpio_hold_dis((gpio_num_t)PREVIEW_BUTTON_PIN);
  esp_sleep_wakeup_cause_t wakeCause = esp_sleep_get_wakeup_cause();
  uint64_t wakePins = wakeCause == ESP_SLEEP_WAKEUP_EXT1 ? esp_sleep_get_ext1_wakeup_status() : 0;
  esp_sleep_disable_wakeup_source(ESP_SLEEP_WAKEUP_TIMER);
  if (extWake == ESP_OK) esp_sleep_disable_wakeup_source(ESP_SLEEP_WAKEUP_EXT1);

  // Po light-sleep czas systemowy szedl z mniej dokladnego RTC slow clock —
  // zakotwicz ponownie z PCF85063A, by dryft nie przesuwal zmiany minuty.
  readRtcToSystem();

  if (wakeCause == ESP_SLEEP_WAKEUP_EXT1) {
    if (wakePins & (1ULL << KEY_PIN)) {
      // Zacznij mierzyc nacisniecie: krotkie -> wycisz budzik / wlacz panel WWW; dlugie -> nic.
      keyRaw = LOW; keyStable = LOW; keyChangedMs = millis();
      keyPressMs = millis(); keyLongFired = false;
      wakeHoldUntilMs = millis() + WAKE_HOLD_MS;
    }
    if (wakePins & (1ULL << PREVIEW_BUTTON_PIN)) {
      bootRaw = LOW; bootStable = LOW; bootPressedMs = millis(); bootChangedMs = millis();
      showPreview();
    }
  }
}

// ============================================================================
//  Przyciski
// ============================================================================
static void showPreview() {
  if (playing || ringing) return;
  previewActive = true;
  previewUntilMs = millis() + ALARM_PREVIEW_MS;
  wakeHoldUntilMs = millis() + WAKE_HOLD_MS;
  displayDirty = true;
}

static void handleKey() {
  bool raw = digitalRead(KEY_PIN);
  if (raw != keyRaw) { keyRaw = raw; keyChangedMs = millis(); }
  if (millis() - keyChangedMs > BUTTON_DEBOUNCE_MS && raw != keyStable) {
    keyStable = raw;
    if (keyStable == LOW) {                         // nacisniety
      keyPressMs = millis(); keyLongFired = false;
      wakeHoldUntilMs = millis() + WAKE_HOLD_MS;
    } else {                                        // zwolniony — akcja krotka
      if (!keyLongFired) {                          // krotki KEY: wycisz budzik lub wlacz panel WWW
        if (playing || ringing) stopPlayback(true); // dzwoni budzik -> wycisz
        else startWebWindow();                       // nie dzwoni -> wlacz panel WWW
      }
      keyPressMs = 0;
    }
  }
  // Dlugie przytrzymanie KEY: nic nie robi — ustawiamy tylko keyLongFired, by
  // zwolnienie po dlugim przytrzymaniu NIE wywolalo akcji krotkiej.
  if (keyStable == LOW && !keyLongFired && keyPressMs != 0 &&
      millis() - keyPressMs >= WEB_LONG_PRESS_MS) {
    keyLongFired = true;
  }
}

static void handleBoot() {
  bool raw = digitalRead(PREVIEW_BUTTON_PIN);
  if (raw != bootRaw) { bootRaw = raw; bootChangedMs = millis(); }
  if (millis() - bootChangedMs > BUTTON_DEBOUNCE_MS && raw != bootStable) {
    bootStable = raw;
    if (bootStable == LOW) { bootPressedMs = millis(); wakeHoldUntilMs = millis() + WAKE_HOLD_MS; }
    else {
      uint32_t press = millis() - bootPressedMs;
      if (bootPressedMs != 0 && press <= 1200) showPreview();
      bootPressedMs = 0;
    }
  }
}

// ============================================================================
//  Inicjalizacja wyswietlacza
//  Ten egzemplarz ST7305 NIE przywraca obrazu po deep-sleep przez sam
//  initInterface() -> pelny re-init (reset RST + begin) przy KAZDYM wybudzeniu.
//  W dzien petla uzywa light-sleep (setup() sie nie powtarza), wiec panel nie jest
//  resetowany i trzyma obraz -> brak mrugania.
// ============================================================================
static inline void st7305SetStaticLowPower(bool enable) {
#if ST7305_STATIC_LPM
  (void)enable;   // zarezerwowane: HPM/LPM panelu — nieprzetestowana komenda, nie wysylamy bez testu
#else
  (void)enable;
#endif
}

