Rubikrubi/zegar-WAVESHARE-ESP32-S3-4-2-cala-RLCD/zegar-WAVESHARE-ESP32-S3-4-2-cala-RLCD v6.0.ino
static void setupDisplay(bool coldBoot) {
  (void)coldBoot;
  pinMode(RLCD_RST_PIN, OUTPUT);
  digitalWrite(RLCD_RST_PIN, HIGH);
  digitalWrite(RLCD_RST_PIN, LOW);
  delay(10);
  digitalWrite(RLCD_RST_PIN, HIGH);
  delay(10);
  // HW SPI: usuwa ~4 s opoznienia pelnego sendBuffer() (programowy SPI przesuwal zmiane minuty).
  SPI.begin(RLCD_SCK_PIN, -1, RLCD_MOSI_PIN, RLCD_CS_PIN);
  display.setBusClock(2000000UL);      // zalecenie sterownika U8g2 dla ST7305
  display.begin();
  gfx = &display;
  gfx->setContrast(255);
  st7305SetStaticLowPower(false);
}

// ============================================================================
//  setup / loop
// ============================================================================
void setup() {
  // Przyczyne wybudzenia ustalamy NAJPIERW — decyduje o delay(300) (tylko zimny
  // start) oraz o akcji po wybudzeniu.
  esp_sleep_wakeup_cause_t cause = esp_sleep_get_wakeup_cause();
  uint64_t ext1WakePins = (cause == ESP_SLEEP_WAKEUP_EXT1) ? esp_sleep_get_ext1_wakeup_status() : 0;
  bool coldBoot = (cause == ESP_SLEEP_WAKEUP_UNDEFINED);
  bool keyWake = coldBoot || cause == ESP_SLEEP_WAKEUP_EXT0 || ((ext1WakePins & (1ULL << KEY_PIN)) != 0);
  bool previewWake = (ext1WakePins & (1ULL << PREVIEW_BUTTON_PIN)) != 0;
  bool rtcWake = (ext1WakePins & (1ULL << RTC_INT_PIN)) != 0;
  bool userWake = keyWake || previewWake;
  bool scheduledWake = rtcWake || cause == ESP_SLEEP_WAKEUP_TIMER;

  Serial.begin(115200);
  if (coldBoot) delay(300);            // delay tylko na zimnym starcie (USB-CDC)
  setCpuFrequencyMhz(DAY_CPU_MHZ);
  watchdogSetup();
  releaseNightHolds();
  pinMode(PA_ENABLE_PIN, OUTPUT);
  digitalWrite(PA_ENABLE_PIN, LOW);
  setupDisplay(coldBoot);

  if (coldBoot) {                       // RTC RAM przezywa deep-sleep -> zeruj tylko na zimnym starcie
    resetTriggerState();
    ntpStartedDay = -1;
    ntpMorningDay = -1;
    batteryHasReading = false; batteryPercent = 0; batteryVoltage = 0.0f;
    g_drain.valid = false;
    g_lastSummaryDay = -1;
    g_wifiHint = false;
    g_bootCount = 0;
    g_coldBootEpoch = 0;
    g_lastRtcDriftSec = 0;
    g_lastNtpSyncEpoch = 0;
    g_prevNtpSyncEpoch = 0;
  }
  g_bootCount++;

  setenv("TZ", TZ_POLAND, 1);
  tzset();

  pinMode(KEY_PIN, INPUT_PULLUP);
  pinMode(PREVIEW_BUTTON_PIN, INPUT_PULLUP);
  pinMode(RTC_INT_PIN, INPUT_PULLUP);
  keyRaw = digitalRead(KEY_PIN);  keyStable = keyRaw;  keyChangedMs = millis();
  bootRaw = digitalRead(PREVIEW_BUTTON_PIN); bootStable = bootRaw; bootChangedMs = millis();

  loadSettings();
#if ENABLE_DIAGNOSTICS
  recordResetReason(esp_reset_reason());
#endif
  Serial.printf("\n=== %s v%s  (build %s %s) ===\n", FW_NAME, FW_VERSION, FW_BUILD_DATE, FW_BUILD_TIME);
  Serial.printf("Rozruch #%u, przyczyna resetu: %s\n", g_bootCount, resetReasonText(esp_reset_reason()));
  updateBattery(true);

  bool timeFromRtc = readRtcToSystem();
  rtcEnsureOffsetCalibration();           // kalibracja dryfu (0x02) + odczyt zwrotny
  bool rtcAlarmCleared = rtcDisableWakeAlarm();
  ntpStatus = timeFromRtc ? "czas z RTC" : "RTC pusty/brak";
  if (rtcWake && !rtcAlarmCleared) ntpStatus = "RTC alarm: blad kasowania";
#if ENABLE_DIAGNOSTICS
  { time_t t0 = time(nullptr);
    if (g_coldBootEpoch == 0 && isSupportedEpoch(t0)) g_coldBootEpoch = (int64_t)t0; }
#endif

  codec.powerDown();                      // ES8311 startuje w stanie niskiego poboru

  if (coldBoot) ensureFsMounted();        // FS tylko do MP3 — montuj leniwie, krotsze wybudzenie
  checkAlarms(scheduledWake ? NTP_ALARM_CATCHUP_SEC : ALARM_LATE_WINDOW_SEC);
  if (!userWake && !ringing) enterNightSleepIfNeeded(true);
#if ENABLE_LOW_BATTERY_PROTECT
  if (!userWake && !ringing) enterCriticalBatterySleepIfNeeded();
#endif

  // WiFi domyslnie OFF. Sync NTP: zimny start, pusty RTC, lub poranne wybudzenie
  // o 06:00 (drugie dobowe synchro obok 10:00). Po zwyklym wybudzeniu wystarcza RTC.
  bool morningSync = false;
  { struct tm t;
    if (getLocalTm(&t) && t.tm_hour == NIGHT_END_HOUR && t.tm_min < NTP_MIN_WINDOW) {
      int day = localDayKey(t);
      if (ntpMorningDay != day) { ntpMorningDay = day; morningSync = true; }   // raz na dobe
    }
  }
  bool willSync = (coldBoot || !timeFromRtc || morningSync);
  if (!willSync) stopWifiAndNtp();
  if (userWake) wakeHoldUntilMs = millis() + WAKE_HOLD_MS;
  if (previewWake) showPreview();
  if (keyWake && !coldBoot) {             // KEY z deep-sleep: zacznij mierzyc nacisniecie (krotkie -> panel WWW)
    keyRaw = LOW; keyStable = LOW; keyChangedMs = millis();
    keyPressMs = millis(); keyLongFired = false;
  }
  if (willSync) {
    ntpRetriesLeft = timeFromRtc ? 2 : 3;   // pusty RTC: kilka szybkich prob, potem backoff
    syncNtp(false);
  }

  displayDirty = true;
}

void loop() {
  watchdogFeed();
  handleKey();
  handleBoot();
  enterNightSleepIfNeeded(false);

  if (webActive) {
    static uint32_t wifiLostMs = 0;
    if (WiFi.status() != WL_CONNECTED) {
      // Chwilowy zanik (roaming) nie zamyka okna od razu: auto-reconnect zwykle wraca.
      if (wifiLostMs == 0) wifiLostMs = millis();
      if (millis() - wifiLostMs > WEB_WIFI_GRACE_MS) { wifiLostMs = 0; statusText = "WiFi rozlaczone"; stopWebWindow(); }
    } else {
      wifiLostMs = 0;
      server.handleClient();
      if ((int32_t)(millis() - webUntilMs) >= 0) stopWebWindow();
    }
  }

  serviceAudio();
  serviceRinging();
  updateBattery(false);
#if ENABLE_LOW_BATTERY_PROTECT
  enterCriticalBatterySleepIfNeeded();
#endif
  bool ntpAdjustedTime = serviceNtp();
  // Okno spoznienia poszerzone o realny przestoj petli: dlugi handleClient (upload
  // MP3) ani 60 s light-sleep nie moga zgubic budzika z terminem w trakcie przestoju.
  static uint32_t lastAlarmCheckMs = 0;
  uint32_t loopGapSec = lastAlarmCheckMs ? (millis() - lastAlarmCheckMs) / 1000UL : 0;
  lastAlarmCheckMs = millis();
  uint32_t lateWindowSec = ntpAdjustedTime ? NTP_ALARM_CATCHUP_SEC : ALARM_LATE_WINDOW_SEC;
  if (loopGapSec + 2 > lateWindowSec) lateWindowSec = loopGapSec + 2;
  checkAlarms(lateWindowSec);
  checkNtpSchedule();
  handleRtcWriteRetry();
  updateDisplay();
  idlePowerSave();
}
